//
//  CSkillLib.h
//  CardDemo
//
//  Created by Hao Zhang on 12-5-8.
//  Copyright (c) 2012年 OneClick Co.,Ltd. All rights reserved.
//

#ifndef CardDemo_CSkillLib_h
#define CardDemo_CSkillLib_h

#include "cocos2d.h"
#include "CGamedata.h"

// 某3种属性同时被消除，攻击力2.5倍
static enElementDef element3Atk25[][3] =
{
    {enElementFire, enElementWater, enElementWood},
    {enElementFire, enElementLight, enElementDark},
    {enElementWater, enElementWood, enElementDark},
    {enElementWater, enElementWood, enElementLight},
    {enElementFire, enElementWood, enElementLight},
    {enElementFire, enElementWater, enElementDark},
    {enElementWater, enElementLight, enElementDark},
    {enElementWood, enElementLight, enElementDark},
    {enElementFire, enElementWater, enElementLight},
};

static enElementDef elementAtk4[][4] =
{
    {enElementFire, enElementWater, enElementWood,enElementLight},
    {enElementWater, enElementWood, enElementLight, enElementDark},
};

//敌人技能
enum enEnemySkill
{
    enEnemySkill_Null = 0,
    enEnemySkill_LianHuan = 1,  //1 连环 x%几率2次100%攻击
    enEnemySkill_LianDa,        //2 连打 x%几率2次70%攻击
    enEnemySkill_ZhongJi,       //3 重击 30%几率1次125%攻击
    enEnemySkill_QiangXi,       //4 强袭 30%几率1次150%攻击
    enEnemySkill_SuiGu,         //5 碎骨 30%几率1次200%攻击
    enEnemySkill_YiShan,        //6 一闪 30%几率刷新宝石方阵
    enEnemySkill_WuShuang,      //7 无双 x%几率5次45%攻击
    
    enEnemySkillHuoXiJin,       //8 封印火系武将,随机2-4回合
    enEnemySkillShuiXiJin,      //9 封印水系武将,随机2-4回合
    enEnemySkillMuXiJin,        //10 封印木系武将,随机2-4回合
    enEnemySkillGuangXiJin,     //11 封印光系武将,随机2-4回合
    enEnemySkillAnXiJin,        //12 封印暗系武将,随机2-4回合
    enEnemySkillShenJin,        //13 封印神系武将,随机2-4回合
    enEnemySkillLuanJin,        //14 随机封印2-4个武将,随机2-4回合
    
    enEnemySkillZhiYu,          //15 当血量低于30%,100%回复自己50%的血量
    enEnemySkillFuHuo,          //16 当血量低于30%，100%回复自己100%的血量
    
    enEnemySkillNiZhuanHuo,     //17 将火宝珠转换成无效块
    enEnemySkillNiZhuanShui,    //18 将水宝珠转换成无效块
    enEnemySkillNiZhuanMu,      //19 将木宝珠转换成无效块
    enEnemySkillNiZhuanGuang,   //20 将光宝珠转换成无效块
    enEnemySkillNiZhuanAn,      //21 将暗宝珠转换成无效块
    enEnemySkillNiZhuanHuiFu,   //22 将回复宝珠转换成无效块
    enEnemySkillNiZhuanTianXia, //23 随机将一种宝珠转化成无效块
    
    enEnemySkillWuShengHuYou,   //24 给自己添加一个buff，持续10回合免疫一切异常状态，包括：威吓、破甲、毒
    enEnemySkillShenLinBiYou,   //25 给自己添加一个buff，持续999回合免疫一切异常状态，包括：威吓、破甲、毒
    enEnemySkillXuShiDaiFa,     //26 1回合后造成300%攻击 50%几率触发
    enEnemySkillJiNu,           //27 持续5回合攻击提升200%
    enEnemySkillKuangBao,       //28 持续10回合攻击提升150%
    enEnemySkillGongJiZiTai,    //29 5回合内提升攻击力125%     80%几率触发
    enEnemySkillBaoNu,          //30 5回合攻击力提升200%伤害    80%几率触发
    enEnemySkillShaShouJian,    //31 3回合后连击,累计造成2000%伤害
    enEnemySkillNanManRuQin,    //32 7连击300%攻击 血量越低触发几率越高
    enEnemySkillZhuQueQi,       //33 随机封印2个武将, 2-4回合 20%几率触发
    enEnemySkillWoHenYing,      //34 什么都不做              40%几率触发
    enEnemySkillTaGengYing,     //35 什么都不做              40%几率触发
    enEnemySkillHaoYin,         //36 什么都不做 为下回合做铺垫             第一次出手即释放
    enEnemySkillTu,             //37 什么都不做            豪饮后30%几率触发
    enEnemySkillMengShowLuanWu, //38 10倍的伤害            豪饮后70%几率触发
    enEnemySkillMuTengJia,      //39 木藤甲                只有火属性才能造成伤害 buff 上来就释放
    enEnemySkillZhenFuHuo,      //40 真复活                复活濒死的武将
    enEnemySkillHuoXiJin40,       //41 封印火系武将,随机2-4回合
    enEnemySkillShuiXiJin40,      //42 封印水系武将,随机2-4回合
    enEnemySkillMuXiJin40,        //43 封印木系武将,随机2-4回合
    enEnemySkillGuangXiJin40,     //44 封印光系武将,随机2-4回合
    enEnemySkillAnXiJin40,        //45 封印暗系武将,随机2-4回合
    enEnemySkillShenJin40,        //46 封印神系武将,随机2-4回合
    enEnemySkillLuanJin40,        //47 随机封印2-4个武将,随机2-4回合
    enEnemySkillFuHuo2,           //48 当血量低于30%，100%回复自己100%的血量，可以放3次
    enEnemySkillHaoYin2,          //49 增加一个buff一直持续，buff存在则有机会发动猛兽乱舞与吐
    
    enEnemySkillHuoXiJin10,       //50 封印火系武将,随机2-4回合
    enEnemySkillShuiXiJin10,      //51 封印水系武将,随机2-4回合
    enEnemySkillMuXiJin10,        //52 封印木系武将,随机2-4回合
    enEnemySkillGuangXiJin10,     //53 封印光系武将,随机2-4回合
    enEnemySkillAnXiJin10,        //54 封印暗系武将,随机2-4回合
    enEnemySkillShenJin10,        //55 封印神系武将,随机2-4回合
    enEnemySkillLuanJin10,        //56 随机封印2-4个武将,随机2-4回合
    enEnemySkillluanshitianxia,   //57 乱世天下 血量50% 20% 30％－50% 40% 小于30% 80 10次25%攻击
    enEnemySkillluanshitianxia2,  //58 乱世天下2 血量50% 20% 30％－50% 40% 小于30% 80 10次25%攻击
    enEnemySkillshuohua20,        //59 20%几率说话
    enEnemySkillxinjinganghuti,   //60 单体buff 新金刚护体 其他怪死完才能对自己造成伤害
    enEnemySkillJiNu2,            //61 持续3回合攻击提升130%   50%概率
    enEnemySkill5lianji,          //62 5连击每次36% 敌人血量大于50%触发几率20%敌人血量50%以下触发几率40%
    enEnemySkillZhuQueQi2,        //63  随机封印2个武将，持续5回合。一局最多3次。20%几率
    enEnemySkillBaoZou,           //64  激怒，999回合攻击力上升为500% 80%触发
    enEnemySkillNanManRuQin2,     //65  连击7次，每次43%攻击80%触发
    enEnemySkillBingFengShiKe,    //66  随机封印5名武将2-4回合（一回合仅1次）
    enEnemySkillEYunYiJi,         //67  连击2~6次，每次30%伤害，几率视血量
    enEnemySkillMuTengJia2,       //68  5回合只有火属性才能造成伤害40%触发
    enEnemySkillXingYunYiJi,      //69  下一次出手随机造成单次攻击：100%、500%、1500% 30%触发几率
    enEnemySkillTongGuiYuJin,     //70  怪物死亡时，造成999伤害 100%几率
    enEnemySkillShiJianNingJie,   //71  一回合行动两次 HP低于50%触发
    enEnemySkillMuTengJia3,       //72  3回合火攻擊無效 第一次出手100%触发
    enEnemySkillDianGuangHuoShi,  //73  进入该局后，先制攻击 造成1200伤害
    enEnemySkillZiBao,            //74  hp<10%触发，造成剩余hp数量的伤害
    enEnemySkillxinjinganghuti2,  //75  单体buff 新金刚护体 其他怪死完才能对自己造成伤害,有怪复活则立即重新上buff
    enEnemySkillBingFengShiKe2,   //76  随机封印5名武将1-2回合（一出手100%触发，仅一次）
    enEnemySkillQuYan,            //77  3回合火攻擊無效 进入该局后，先制攻击
    enEnemySkillDuanLiu,          //78  3回合水攻擊無效 进入该局后，先制攻击
    enEnemySkillPoMu,             //79  3回合木攻擊無效 进入该局后，先制攻击
    enEnemySkillZhanLei,          //80  3回合光攻擊無效 进入该局后，√攻击
    enEnemySkillShiHun,           //81  3回合暗攻擊無效
    enEnemySkill_LianJi82,        //82  2连击 每次80%伤害 血量50% 20% 30％－50% 40% 小于30% 80
    enEnemySkill_LianJi83,        //83  6连击 累计600%伤害 血量50% 20% 30％－50% 40% 小于30% 80
    enEnemySkillBaoZhuYinCang,    //84  转换，所有宝珠的颜色变成黑色，移动后可恢复原本的颜色。
    enEnemySkillShiguangnizhuan,  //85  敌人会将所有队员技能CD重置
    enEnemySkillZiBao2,           //86  hp<10%触发，造成剩余hp数量的伤害(每回合结束后检查)
    enEnemySkillkengdiezhuanshui, //87  HP低于75%，25%几率发动 屏幕內所有木宝珠转暗宝珠
    enEnemySkillkengdiezhuanhuo,  //88  HP低于75%，25%几率发动 屏幕內所有水宝珠转光宝珠
    enEnemySkillkengdiezhuanmu,   //89  HP低于75%，25%几率发动 屏幕內所有火宝珠转木宝珠
    enEnemySkillkengdiezhuanguang,//90  HP低于75%，25%几率发动 屏幕內所有光宝珠转火宝珠
    enEnemySkillkengdiezhuanan,   //91  HP低于75%，25%几率发动 屏幕內所有暗宝珠转水宝珠
    enEnemySkillkengdiezhuanshui2, //92  HP低于75%，25%几率发动 屏幕內所有木宝珠转暗宝珠
    enEnemySkillkengdiezhuanhuo2,  //93  HP低于75%，25%几率发动 屏幕內所有水宝珠转光宝珠
    enEnemySkillkengdiezhuanmu2,   //94  HP低于75%，25%几率发动 屏幕內所有火宝珠转木宝珠
    enEnemySkillkengdiezhuanguang2,//95  HP低于75%，25%几率发动 屏幕內所有光宝珠转火宝珠
    enEnemySkillkengdiezhuanan2,   //96  HP低于75%，25%几率发动 屏幕內所有暗宝珠转水宝珠
    
    enEnemySkillZhuQueQi3,         //97  HP25%↓：必用；最多1次 封印随机1宠物5回合(缝影之术)
    enEnemySkillJiNu3,             //98  HP25%↓：必用 持续5回合攻击提升300%(当前已在buff下不释放)(刚力药丸)
    enEnemySkillSuiGu2,            //99  碎骨，造成相当于200%的攻击伤害。(第一次行动必用,最多1次.)(必杀重击)
    enEnemySkillSuiGu3,            //100 碎骨，造成相当于400%的攻击伤害。(第一次行动必用,最多1次.)(必杀强击)
    enEnemySkillShuiXiJin1_3,      //101 封印所有水系武将,随机1-3回合(第一次行动必用；最多1次；没有水系队员时不会使用)(严禁潮湿)
    enEnemySkillHuoXiJin1_3,       //102 封印所有火系武将,随机1-3回合(第一次行动必用；最多1次；没有火系队员时不会使用)
    enEnemySkillMuXiJin1_3,        //103 封印所有木系武将,随机1-3回合(第一次行动必用；最多1次；没有木系队员时不会使用)
    enEnemySkillGuangXiJin1_3,     //104 封印所有光系武将,随机1-3回合(第一次行动必用；最多1次；没有光系队员时不会使用)
    enEnemySkillAnXiJin1_3,        //105 封印所有暗系武将,随机1-3回合(第一次行动必用；最多1次；没有暗系队员时不会使用)
    enEnemySkillShenJin1_3,        //106 封印所有神系武将,随机1-3回合(第一次行动必用；最多1次；没有神系队员时不会使用) 
    enEnemySkill_LianJi7_3,        //107 连击3次,每次造成相当于70%的攻击伤害(HP50%↓：75%发动)(3连击)
    enEnemySkill_LianJi45_4,       //108 连击4次,每次造成相当于45%的攻击伤害(HP50%↓：75%发动)(4连击)
    enEnemySkill_LianJi75_3,       //109 连击3次,每次造成相当于75%的攻击伤害(HP75%↓：70%发动)(强力3连击)
    enEnemySkillLuanJin3_23,       //110 随机封印3个武将,随机2-3回合(HP39%↓：必用；最多1次)(水晶棺材)
    enEnemySkillNiZhuanTianXia2,   //111 随机将2种宝珠转化成无效块(HP55%↓：20%发动；最多1次)
    enEnemySkillLuanJinRun2_3_23,  //112 随机封印3武将2~3回合(第二次行动必用,最多1次)(绝景哉，绝景哉)
    
    enEnemySkill_113,              //113 封印5名武将4-5回合(腿好酸)
    enEnemySkill_114,              //114 封印3名武将4-5回合,20%几率(揉揉腿)
    enEnemySkill_115,              //115 疾驰小阿星 5连击，每次40%伤害
    enEnemySkill_116,              //116 贝吉兔大炮 扣除99%当前hp         115 ，116号技能是配套技能
    enEnemySkill_117,              //117 通信错误,20%几率发动,随机两色宝珠变炸弹3回合,每颗造成1000点伤害
    
    enEnemySkill_118,              //118 七支刀 HP70%↓：当剩下1只时必用 增益，攻击力变为200%，持续999回合。
    enEnemySkill_119,              //119 七天伐刀 HP30%↓：必用 连击7次，每次造成相当于30%的攻击伤害。
    enEnemySkill_120,              //120 毒物散布 HP75%↓：必用；最多1次 封印所有神类宠物3~4回合
    enEnemySkill_121,              //121 神王的眼光 HP50%↓：必用；最多1次 封印所有神类宠物2~4回合
    enEnemySkill_122,              //122 友好的握手 增益,当剩下1只时必用;攻击力变为300%,持续999回合。
    enEnemySkill_123,              //123 复位波///
    enEnemySkill_124,              //124 虚无的波动///
    enEnemySkill_125,              //125 世界终焉 连击	,行动次数为3的倍数时使用(如第3、6、9次行动时会使用);连击6次,每次造成相当于180%的攻击伤害。
    enEnemySkill_126,              //126 超.火焰束缚 封印 第一次行动必用；最多1次 封印所有火系宠物10回合
    enEnemySkill_127,              //127 超.寒冰束缚 封印 第一次行动必用；最多1次 封印所有水系宠物10回合
    enEnemySkill_128,              //128 磨光的眼光 先制 100%先制攻击；造成100%基本攻击力的伤害
    enEnemySkill_129,              //129 神速 先制 100%先制攻击;造成50%基本攻击力的伤害。
    enEnemySkill_130,              //130 神王的洗礼 先制 100%先制攻击;造成75%基本攻击力的伤害。
    
    enEnemySkill_131,              //131 猫拳击！重击，造成相当于1000%的攻击伤害。100%释放
    enEnemySkill_132,              //132 焰尾之猛袭攻击HP30%↓：必用	连击5次，每次造成相当于30%的攻击伤害。
    enEnemySkill_133,              //133 不动如山	攻击	HP30%↓：必用；最多1次	蓄力，下一次攻击造成额外100%伤害。
    enEnemySkill_134,              //134 业炎变化术·暗	    转珠	50%发动	所有火宝珠变成暗宝珠。
    enEnemySkill_135,              //135 暗黑变化术・水	转珠	50%发动	所有暗宝珠变成水宝珠。
    enEnemySkill_136,              //136 流水变化术·木	    转珠	50%发动	所有水宝珠变成木宝珠。
    enEnemySkill_137,              //137 气合蓄力	增益	HP50%↑：50%发动	蓄力，下一次攻击造成额外100%伤害。
    enEnemySkill_138,              //138 冰结打击	攻击	HP49%↓：必用	重击，造成相当于150%的攻击伤害。
    enEnemySkill_139,              //139 木遁・炎灭根	转珠	首次攻击必然使用,之后每攻击两次便使用一次	所有火宝珠变成木宝珠，并同时造成70%伤害。
    enEnemySkill_140,              //140 晓光之术	转珠	首次攻击必然使用，之后每1~2回合使用1次	随机一种宝珠变成光宝珠，并同时造成70%伤害。
    enEnemySkill_141,              //141 忍法・风魔手里剑	攻击	HP75%↓：70%发动	连击7次，每次造成相当于20%的攻击伤害。
    enEnemySkill_142,              //142 练武的极意	增益	HP39%↓：必用	增益，攻击力变为200%，持续99回合。
    enEnemySkill_143,              //143 旋风斩	攻击	HP30~75%：70%发动	连击5次，每次造成相当于25%的攻击伤害。
    enEnemySkill_144,              //144 突然掀起的暴风	发呆	HP29%↓：必然重复使用	发呆
    enEnemySkill_145,              //145 烈空一闪	攻击	HP29%↓：使用突然掀起的暴风后必然使用	重击，造成相当于300%的攻击伤害。
    enEnemySkill_146,              //146 突击阵型	增益	当剩下1只时必用	 增益，攻击力变为200%，持续99回合。
    enEnemySkill_147,              //147 狂暴斩击	攻击	70%发动	连击3~6次，每次造成相当于30%的攻击伤害。
    enEnemySkill_148,              //148 雷遁・雷束缚	封印	40%发动；最多1次	封印随机1武将10回合，期间不能发动攻击，无法使用主动技能，队长技能失效。技能冷却会正常计算，如果武将队长技能增加HP上限，则HP上限会立刻减少（当前HP也会随着新上限变化），束缚结束HP上限回复，但当前HP不会回复。
    enEnemySkill_149,              //149 体练法的极意	增益	HP29%↓：必用	蓄力，下一次攻击造成额外400%伤害。
    enEnemySkill_150,              //150 宝珠狩猎	限制	40%发动	随机一种宝珠变成无效块，并同时造成70%伤害
    enEnemySkill_151,              //151 雷云之吐息	攻击	必用	连击3~5次，每次造成相当于25%的攻击伤害。
    enEnemySkill_152,              //152 天下统一	封印	HP19%↓：必用；最多1次	封印随机6武将2~4回合，期间不能发动攻击，无法使用主动技能，队长技能失效。技能冷却会正常计算，如果武将队长技能增加HP上限，则HP上限会立刻减少（当前HP也会随着新上限变化），束缚结束HP上限回复，但当前HP不会回复。
    enEnemySkill_153,              //153 真・缝影之术	封印	HP75%↓：必用；最多1次	封印所有光系武将2~4回合，期间不能发动攻击，无法使用主动技能，队长技能失效。技能冷却会正常计算，如果武将队长技能增加HP上限，则HP上限会立刻减少（当前HP也会随着新上限变化），束缚结束HP上限回复，但当前HP不会回复。
    enEnemySkill_154,              //154 胧连斩	攻击	HP50%↓：70%发动	连击3~6次，每次造成相当于40%的攻击伤害。
    enEnemySkill_155,              //155 天魔龙的咆哮	封印	HP75%↓：必用；最多1次	封印所有国士无双类武将2~4回合，期间不能发动攻击，无法使用主动技能，队长技能失效。技能冷却会正常计算，如果武将队长技能增加HP上限，则HP上限会立刻减少（当前HP也会随着新上限变化），束缚结束HP上限回复，但当前HP不会回复。
    enEnemySkill_156,              //156 闪耀登场   先制 100%, 护盾10回合
    
    enEnemySkill_157,              //157 黑色感情	增益	HP75%↓：75%发动	蓄力，下一次攻击造成额外200%伤害。
    
    enEnemySkill_158,              //158 燃烧吧！	攻击	HP30%↓：60%发动	连击2~5次，每次造成相当于50%的攻击伤害。
    
    enEnemySkill_159,              //159 孤军奋战	增益	当剩下1只时必用	增益，攻击力变为300%，持续999回合。
    
    enEnemySkill_160,              //160 天使光环	封印	HP50%↓：必用；最多1次	封印随机4宠物1~2回合，期间不能发动攻击，无法使用主动技能，队长技能失效。技能冷却会正常计算，如果宠物队长技能增加HP上限，则HP上限会立刻减少（当前HP也会随着新上限变化），束缚结束HP上限回复，但当前HP不会回复。
    
    enEnemySkill_161,              //161 一刀两断	攻击	HP25%↓：必用	重击，造成相当于200%的攻击伤害。
    
    enEnemySkill_162,              //162 黑暗闪电	转珠	第一次行动必用；最多1次	所有宝珠的颜色变成黑色，移动后可恢复原本的颜色。
    
    enEnemySkill_163,              //163 百万推力	攻击	HP75%↓：70%发动	连击3~6次，每次造成相当于40%的攻击伤害。
    
    enEnemySkill_164,              //164 神风	攻击	HP30%↓：必用	连击4次，每次造成相当于100%的攻击伤害。
    
    enEnemySkill_165,              //165 魔力聚集 血量24%以下时，优先必用，之后必然使用编号168：魔力咆哮 纯说话，什么都不做
    
    enEnemySkill_166,              //166 左右掌嘴	攻击	HP25~60%：50%发动	连击3次，每次造成相当于60%的攻击伤害。
    
    enEnemySkill_167,              //167 神的恶作剧	转珠	HP25%↑：必用；最多1次；如直接降低至25%以下则不会使用	 转换，随机2种宝珠变化成无效块，无效块消除后只能提供Combo，不产生其他效果。
    
    enEnemySkill_168,              //168 重力炸弹	攻击	HP24%↓：必用	重击，造成相当于600%的攻击伤害。和165号技能轮流用
    
    enEnemySkill_169,              //169 朱庇特创世	攻击	HP30%↓：75%发动	重击，造成相当于200%的攻击伤害。
    
    enEnemySkill_170,              //170 迪奥斯之刃	攻击	HP70%↓：75%发动	连击4~6次，每次造成相当于30%的攻击伤害。
    
    enEnemySkill_171,              //171 说话
    enEnemySkill_172,              //172 说话
    enEnemySkill_173,              //173 说话
    enEnemySkill_174,              //174 说话
    enEnemySkill_175,              //175 说话
    enEnemySkill_176,              //176 说话
    enEnemySkill_177,              //177 说话
    enEnemySkill_178,              //178 说话
    enEnemySkill_179,              //179 说话
    enEnemySkill_180,              //170 说话
    enEnemySkill_181,              //181 说话
    enEnemySkill_182,              //182 说话
    enEnemySkill_183,              //183 说话
    enEnemySkill_184,              //184 说话
    enEnemySkill_185,              //185 说话
    enEnemySkill_186,              //186 说话
    enEnemySkill_187,              //187 说话
    enEnemySkill_188,              //188 说话
    enEnemySkill_189,              //189 说话
    enEnemySkill_190,              //190 说话
    
    enEnemySkill_191,              //191 超.木束缚 封印 第一次行动必用；最多1次 封印所有木系宠物10回合
    enEnemySkill_192,              //192 超.光束缚 封印 第一次行动必用；最多1次 封印所有光系宠物10回合
    enEnemySkill_193,              //193 超.暗束缚 封印 第一次行动必用；最多1次 封印所有暗系宠物10回合
    
    //...
    enEnemySkill_194,              //194 进攻!(连击) 显示3,2,1后连击3次，每次造成相当于100%的攻击伤害(倒数3回合后必用)
    enEnemySkill_195,              //195 攻上来吧(回复血量) 回复玩家100%HP(先制发动)
    enEnemySkill_196,              //196 蛮王之爪(宝珠转换) 随机一色宝珠变成废宝珠，同时造成相当于70%的攻击伤害(血量50%及以上时，30%几率发动)
    enEnemySkill_197,              //197 蛮王乱舞(连击) 连击4~6次，每次造成相当于25%的攻击伤害(血量50%及以上时，100%几率发动)
    enEnemySkill_198,              //198 异兽咆哮(百分比扣血) 造成玩家当前HP99%的伤害(血量49%以下时，使用后，下次出手必用技能“终结”)
    enEnemySkill_199,              //199 终结(重击) 重击，造成相当于125%的攻击伤害(血量49%以下时，使用后，下次出手必用技能“异兽咆哮”)
    enEnemySkill_200,              //200 来决斗吧(回复血量) 回复玩家100%HP(先制发动)
    enEnemySkill_201,              //201 哈哈哈!(说话) 纯说话，什么都不做(血量100%及以上时，必用)
    enEnemySkill_202,              //202 虎妹守护(增益) 增益，攻击力变为300%，持续999回合(血量99%以下时，必用)
    enEnemySkill_203,              //203 流星飞锤(宝珠转换) 随机一种宝珠变成水宝珠，同时造成相当于70%的攻击伤害(血量在50%-99%之间时，必用)
    enEnemySkill_204,              //204 虎痴乱舞(重击)重击，造成相当于88%的攻击伤害(血量49%以下时，必用)
    enEnemySkill_205,              //205 来吧骚年(回复血量) 回复玩家100%HP(先制发动)
    enEnemySkill_206,              //206 武圣模式(增益) 增益，免疫一切异常状态（如毒、破甲、威吓），持续999回合(首次出手必用)
    enEnemySkill_207,              //207 一刀绝空(宝珠转换) 随机一种宝珠变成光宝珠，并同时造成80%伤害(血量50%及以上时，60%几率发动)
    enEnemySkill_208,              //208 无双破极(连击) 连击6次，每次造成相当于20%的攻击伤害(血量在15%-49%之间时，70%几率发动)
    enEnemySkill_209,              //209 有两下子(说话) 纯说话，什么都不做(血量14%以下时，优先必用，最多1次)
    enEnemySkill_210,              //210 将星爆裂(连击) 连击10次，每次造成相当于100%的攻击伤害(血量14%以下时，必用)
    enEnemySkill_211,              //211 大熊吊挂(封印) 封印1名武将10回合(血量50%及以上时,90%几率发动，最多1次)
    enEnemySkill_212,              //212 破木-火(重击) 重击，造成相当于150%的攻击伤害(血量49%以下时，必用)
    enEnemySkill_213,              //213 封印-水(封印) 封印所有水属性武将2-4回合(血量50%及以上时,90%几率发动，最多1次)
    enEnemySkill_214,              //214 鸡肋鸡肋(先制攻击) 先制攻击，造成100%基本攻击力的伤害(先制发动)
    enEnemySkill_215,              //215 落雷(连击) 连击3次，每次造成相当于40%的攻击伤害(血量50%及以上时，70%几率发动)
    enEnemySkill_216,              //216 轰栏炎炮(重击) 重击，造成相当于200%的攻击伤害(血量49%以下时，必用)
    enEnemySkill_217,              //217 神兽庇护(增益) 增益，免疫一切异常状态（如毒、破甲、威吓），持续999回合(先制发动)
    enEnemySkill_218,              //218 烈焰焚天(连击) 连击2次，每次造成相当于50%的攻击伤害(血量50%及以上时，必用)
    enEnemySkill_219,              //219 封印-水(封印) 封印所有水属性武将2-4回合(血量49%以下时，优先必用，最多1次)
    enEnemySkill_220,              //220 森罗灭绝(连击) 连击2次，每次造成相当于75%的攻击伤害(血量49%以下时，必用，最多1次)
    enEnemySkill_221,              //221 连珠箭(先制攻击) 先制攻击，造成100%基本攻击力的伤害(先制发动)
    enEnemySkill_222,              //222 炎神蛇矛(连击) 连击2次，每次造成相当于50%的攻击伤害(血量50%及以上时，必用)0
    enEnemySkill_223,              //223 魔封-暗(封印) 封印所有暗属性武将10回合(血量49%以下时，优先必用，最多1次)
    enEnemySkill_224,              //224 灭神模式(说话) 纯说话，什么都不做(血量49%以下时，优先必用，最多1次)
    enEnemySkill_225,              //225 炎神咆哮(连击) 连击4~6次，每次造成相当于30%的攻击伤害(血量49%以下时，必用，使用“黑炎模式”后连续使用)
    enEnemySkill_226,              //226 神之守护(增益) 增益，免疫一切异常状态（如毒、破甲、威吓），持续999回合(先制发动)
    enEnemySkill_227,              //227 魔封-水(封印) 封印所有水属性武将10回合(血量50%及以上时，必用，最多1次)
    enEnemySkill_228,              //228 凶焰连弹(连击) 连击3次，每次造成相当于45%的攻击伤害(血量50%及以上时，70%几率发动)
    enEnemySkill_229,              //229 黑炎弹(重击) 重击，造成相当于170%的攻击伤害(血量在25%-49%之间时，70%几率发动)
    enEnemySkill_230,              //230 魔将觉醒(说话) 纯说话，什么都不做(血量24%以下时，优先必用，最多1次)
    enEnemySkill_231,              //231 黑炎灭杀(重击) 重击，造成相当于600%的攻击伤害(血量24%以下时，必用，使用“魔将觉醒”后连续使用)
    enEnemySkill_232,              //232 孤军奋战(增益) 增益，攻击力变为300%，持续999回合(当剩下1只敌将时必用)
    enEnemySkill_233,              //233 闪光弹(封印) 封印4名武将1-2回合(血量49%以下时，必用，最多1次)
    enEnemySkill_234,              //234 点起蜡烛(宝珠转换) 所有暗宝珠变成光宝珠(25%几率发动)
    enEnemySkill_235,              //235 我来啦!(说话) 纯说话，什么都不做(首次出手必用，最多1次)
    enEnemySkill_236,              //236 粘刀切割(说话) 纯说话，什么都不做(第2次出手开始使用，连续使用2次后，会使用1次“镰刀切割”)
    enEnemySkill_237,              //237 镰刀切割(重击) 重击，造成相当于400%的攻击伤害(参考上一个技能发动条件)
    enEnemySkill_238,              //238 嚣张起来(下次重击) 蓄力，下一次攻击造成200%的攻击伤害(50%几率发动)
    enEnemySkill_239,              //239 回旋双斧(连击) 连击7次，每次造成相当于20%的攻击伤害(血量49%以下时，必用)
    enEnemySkill_240,              //240 擦擦鞭子(说话) 纯说话，什么都不做(血量100%及以上时，必用)
    enEnemySkill_241,              //241 抽(重击) 重击，造成相当于300%的攻击伤害(血量99%以下时，必用)
    enEnemySkill_242,              //242 冰之缠绕(封印) 封印所有火属性武将2-4回合(血量49%以下时，必用，最多1次)
    enEnemySkill_243,              //243 木桩囚笼(封印) 封印1名武将5回合(血量49%以下时，必用，最多1次)
    enEnemySkill_244,              //244 正义凝视(特殊) 防御姿态（仁王盾等）、属性攻击增幅（北欧神主动技）等技能无效化(我方有状态效果时必用)
    enEnemySkill_245,              //245 不要火!(封印) 封印所有火属性武将2-4回合(血量50%及以上时，必用，最多1次)
    enEnemySkill_246,              //246 组合拳(连击) 连击2次，每次造成相当于60%的攻击伤害(血量50%及以上时，必用)
    enEnemySkill_247,              //247 龙将强化(增益) 增益，攻击力变为200%，持续999回合(血量49%以下时，必用)
    enEnemySkill_248,              //248 拳打脚踢(连击) 连击2次，每次造成相当于85%的攻击伤害(血量25%以下时，必用)
    enEnemySkill_249,              //249 蓄力(增益) 增益，攻击力变为300%，持续5回合(血量25%以下时，必用)
    enEnemySkill_250,              //250 怒蓄力(下次重击) 蓄力，下一次攻击造成200%伤害(血量50%及以上时，50几率发动)
    enEnemySkill_251,              //251 断流-木(重击) 重击，造成相当于150%的攻击伤害(血量49%以下时，必用)
    enEnemySkill_252,              //252 前军集结(增益) 增益，攻击力变为200%，持续99回合(当剩下1只敌将时必用)
    enEnemySkill_253,              //253 火焰斩击(连击) 连击3~6次，每次造成相当于30%的攻击伤害(70%几率发动)
    enEnemySkill_254,              //254 封印-火(封印) 封印所有火属性武将2-4回合(首次出手必用，最多1次)
    enEnemySkill_255,              //255 暗影变幻(宝珠转换) 所有暗宝珠变成水宝珠(50%几率发动)
    enEnemySkill_256,              //256 吃了吗?(说话) 纯说话，什么都不做(首次出手必用，最多1次)
    enEnemySkill_257,              //257 重斩(重击) 重击，造成相当于1000%的攻击伤害(必用)
    enEnemySkill_258,              //258 封印-光(封印) 封印所有光属性武将2-4回合(首次出手必用，最多1次)
    enEnemySkill_259,              //259 爆炎变幻(宝珠转换) 所有火宝珠变成暗宝珠(50%几率发动)
    enEnemySkill_260,              //260 强力牵制(封印) 封印1名武将5回合(血量25%以下时，必用，最多一次)
    enEnemySkill_261,              //261 迅捷一击(先制攻击) 先制攻击，造成50%基本攻击力的伤害(先制发动)
    enEnemySkill_262,              //262 双焰重斩(重击) 重击，造成相当于125%的攻击伤害(血量25%以下时，必用)
    enEnemySkill_263,              //263 锁!(封印) 封印3名武将3回合(血量40%及以上时，必用，最多1次)
    enEnemySkill_264,              //264 横斩!(重击) 重击，造成相当于150%的攻击伤害(血量40%及以上时，60%几率发动)
    enEnemySkill_265,              //265 变!(宝珠转换) 随机一种宝珠变成废宝珠，并同时造成70%伤害(血量40%及以上时，24%几率发动)
    enEnemySkill_266,              //266 集中精神(说话) 纯说话，什么都不做(血量39%以下时，必然重复使用)
    enEnemySkill_267,              //267 修罗奥义(连击) 连击4次，每次造成相当于200%的攻击伤害(血量39%以下时，“集中精神”后必然使用)
    enEnemySkill_268,              //268 冲撞(连击) 连击2次，每次造成相当于50%的攻击伤害(必用)
    enEnemySkill_269,              //269 直拳连发(连击) 连击2次，每次造成相当于70%的攻击伤害(血量75%以下时，70%几率发动)
    enEnemySkill_270,              //270 熊抱(封印) 封印神将类武将2-4回合(血量50%以下时，必用，最多一次)
    enEnemySkill_271,              //271 粉碎背摔(连击) 连击3~5次，每次造成相当于30%的攻击伤害(血量75%以下时，70%几率发动)
    enEnemySkill_272,              //272 刚体(增益) 增益，免疫一切异常状态（如毒、破甲、威吓），持续999回合(先制发动)
    enEnemySkill_273,              //273 冲刺直拳(重击) 重击，造成相当于300%的攻击伤害(必用)
    enEnemySkill_274,              //274 四处张望(说话) 纯说话，什么都不做(首次出手必用，最多1次)
    enEnemySkill_275,              //275 猛烈冲撞(连击) 连击3次，每次造成相当于100%的攻击伤害(必用)
    enEnemySkill_276,              //276 连环腿(连击) 连击2次，每次造成相当于75%的攻击伤害(血量75%以下时，50%几率发动)
    enEnemySkill_277,              //277 暗器投掷(连击) 连击3~5次，每次造成相当于30%的攻击伤害(血量75%以下时，50%几率发动)
    enEnemySkill_278,              //278 翻跟斗(宝珠转换) 所有火宝珠变化成无效块，无效块消除后只能提供Combo，不产生其他效果(70%几率发动)
    enEnemySkill_279,              //279 包扎(回复血量) 治疗，回复50%HP(血量30%以下时，必用，最多1次)
    enEnemySkill_280,              //280 火焰飞踢(重击) 重击，造成相当于200%的攻击伤害(血量25%以下时，必用)
    enEnemySkill_281,              //281 寸拳(宝珠转换) 随机一种宝珠变成无效块，并同时造成70%伤害(必用；隔回合使用)
    enEnemySkill_282,              //282 续命(回复血量) 治疗，回复100%HP(血量20%以下时，必用，最多1次)
    enEnemySkill_283,              //283 超重击(重击) 重击，造成相当于200%的攻击伤害(必用)
    enEnemySkill_284,              //284 封印-木(封印) 封印所有木属性武将2-4回合(必用，最多1次)
    enEnemySkill_285,              //285 烈焰突刺(连击) 连击2次，每次造成相当于70%的攻击伤害(血量75%以下时，必用)
    enEnemySkill_286,              //286 给我让开 重击（必用） 造成相当于100%的攻击力伤害
    enEnemySkill_287,              //287 别挡道  增益（当剩下1只敌将时必用） 增益，攻击力变为200%，持续999回合
    enEnemySkill_288,              //288 着火啦！ 宝珠转换+伤害 （必用）隔回合使用（一回合普通攻击一回合该技能）所有火宝珠变成无效块，并同时造成70%的伤害
    enEnemySkill_289,              //289 救火啊！ 宝珠转换+伤害 （必用）隔回合使用（一回合普通攻击一回合该技能）所有水宝珠变成无效块，并同时造成70%的伤害
    enEnemySkill_290,              //290 我的粮食 宝珠转换+伤害 （必用）隔回合使用（一回合普通攻击一回合该技能）所有木宝珠变成无效块，并同时造成70%的伤害
    enEnemySkill_291,              //291 炎牢柱   封印  血量50%以下时，必用，最多一次 封印随机4名武将1~2回合
    enEnemySkill_292,              //292 连续攻击 连击   血量75%以下40%发动 连击两次每次造成70%的伤害
    enEnemySkill_293,              //293 恶作剧   宝珠转换  10%几率发动，最多2次，随机一种珠子转换成无效块
    enEnemySkill_294,              //294 会心一击  下次重击  血量30%以下时必用，蓄力，下次攻击造成相当于1100%的伤害
    enEnemySkill_295,              //295 战术扰乱   宝珠转换+伤害  70%的几率发动，随机一种宝珠变成无效块，并造成80%的伤害
    enEnemySkill_296,              //296 箭雨    先制攻击  造成玩家当前生命值50%的伤害，该伤害可以使用减伤宠物防御
    enEnemySkill_297,              //297 预击流程  说话，  首次出手必用，和298“炎斧重击”轮流使用  纯说话，什么都不做
    enEnemySkill_298,              //298 炎斧重击  和297“预击流程”轮流使用  重击。造成相当于500%的攻击伤害
    enEnemySkill_299,              //299 玄冰炼狱  先制攻击   造成玩家当前生命值99%的伤害，该伤害可以使用减伤宠物防御
    enEnemySkill_300,              //300 冰剑乱舞  连击     血量30%以下时，必用  连击4~5次，每次造成相当于50%的攻击伤害
    enEnemySkill_301,              //301 裂冰斩    宝珠转换+伤害  首次出手必用；和302“冰剑连击”轮流使用  随机一种宝珠变成水宝珠，并同时造成80%的伤害
    enEnemySkill_302,              //302 冰剑连击  连击    和301“裂冰斩”轮流使用 连击4~5次，每次造成相当于30%的攻击伤害
    enEnemySkill_303,              //303 愤怒  发怒  增益   40%几率发动    增益，攻击力变为130%，持续3回合
    enEnemySkill_304,              //304 浓墨  黑暗世界  宝珠转换  25%几率发动  所有宝珠的颜色变成黑色，移动后可恢复原本的颜色
    enEnemySkill_305,              //305 笔伐  打脸   重击  75%几率发动  重击，造成相当于125%的攻击伤害
    enEnemySkill_306,              //306 投魏  愤怒之吼 增益  当剩下一只敌将时必用  增益攻击力变为300%，持续10回合
    enEnemySkill_307,              //307 归蜀  狼连击   连击  血量70%以下时，70%几率发动  连击5次，每次造成25%的攻击伤害
    enEnemySkill_308,              //308 浓墨  黑暗世界  宝珠转换  先制攻击  所有宝珠的颜色变成黑色，移动后可恢复原本的颜色
    enEnemySkill_309,              //309 笔伐。天  血腥之爪  连击  血量70%以下时，70%几率发动  连击2次，每次造成65%的攻击伤害
    enEnemySkill_310,              //310 檄文  魅惑   封印  血量30%以下时必用，最多一次  封印随机4名武将1~2回合
    enEnemySkill_311,              //311 忠诚之心   古代的智慧 先制攻击  必用 增益，免疫一切异常状态（如毒、破甲、威吓），持续999回合
    enEnemySkill_312,              //312 誓死效忠 昴宿之歼光  连击 倒数3回合后必用  显示3，2，1后连击7次，每次造成相当于200%的攻击伤害（倒数3回合后，必用）
    enEnemySkill_313,              //313 炎杀剑   火焰碎击  宝珠转换+伤害  首次出手时必用，最多一次，所有火宝珠变成无效块，并同时造成50%伤害
    enEnemySkill_314,              //314 蓄力斩   气合蓄力  下次重击  血量50%以下时，40%发动  蓄力，下次攻击造成额外100%伤害
    enEnemySkill_315,              //315 迅炎    迅捷一击 先制攻击  必用  重击，造成相当于20%的攻击伤害
    enEnemySkill_316,              //316 重炎斩  全力挥击  下次重击  血量40%以下时，必用  重击，造成相当于150%的攻击伤害
    enEnemySkill_317,              //317 囚禁    双手束缚  封印    血量9%以下时，必用   封印随机1敌将10回合
    enEnemySkill_318,              //318 火焰巨浪  巨石重压 先制攻击  必用一次  造成玩家当前生命值99%的伤害，该伤害可以使用减伤宠物防御
    enEnemySkill_319,              //319 火焰巨浪  巨石重压 百分比扣血  血量30%及以上时，每用2次普攻后使用一次该技能   造成玩家当前生命值99%的伤害，该伤害可以使用减伤宠物防御
    enEnemySkill_320,              //320 火焰连弹  流星雨  连击   血量29%以下时必用  连击5~7次，每次造成相当于20%的攻击伤害
    enEnemySkill_321,              //321 稍安勿躁  哔唷哔唷的叫着 说话   15%几率发动   纯说话，什么都不做
    enEnemySkill_322,              //322 冰雾   眼花缭乱  宝珠转换   25%几率发动    转换，随机2种宝珠变化成无效块
    enEnemySkill_323,              //323 水牢术  魔鬼之眼  封印   血量30%以下时，必用，最多一次  封印随机1武将5回合
    enEnemySkill_324,              //324 大水牢术  魔眼之瞳  封印  血量30%以下时，必用，最多一次  封印随机2武将4回合
    enEnemySkill_325,              //325 激流障壁  古代的智慧  先制攻击   必用  增益，免疫一切异常状态（如毒、破甲、威吓），持续999回合
    enEnemySkill_326,              //326 波涛之枪 欣惠之水星   宝珠转换+伤害  血量30%以上时，25%几率发动  随机一种宝珠变成水宝珠 并同时造成80%的伤害
    enEnemySkill_327,              //327 激流凶星   灾厄之凶星   百分比扣血  血量30%以上时，40%几率发动  造成玩家当前生命值50%的伤害，该伤害可以使用减伤宠物防御
    enEnemySkill_328,              //328 流水突刺   齿轮。冲击   重击   血量30%以上时，30%几率发动   重击，造成相当于125%的攻击伤害
    enEnemySkill_329,              //329 群星爆破   连击     血量30%以下时，必用  连击12次，每次造成相当于15%的攻击伤害
    enEnemySkill_330,              //330 偷袭  先制攻击    必用 造成相当于30%的攻击伤害
    enEnemySkill_331,              //331 乱斩  百分比扣血    首次出手时必用，和322“重斩”轮流使用 造成玩家当前生命值99%的伤害，该伤害可以使用减伤宠物防御
    enEnemySkill_332,              //332 重斩  重击   和331“乱斩”轮流使用   重击，造成相当于180%的攻击伤害
    enEnemySkill_333,              //333 麻袋  宝珠转换   先制攻击，必用    所有宝珠的颜色变成黑色，移动后可恢复原本的颜色
    enEnemySkill_334,              //334 大刀  重击    首次出手必用和335”大重刀“轮流使用   重击，造成相当于100%的攻击伤害
    enEnemySkill_335,              //335 大重刀  重击   和334”大刀“轮流使用  重击，造成相当于180%的攻击伤害
    enEnemySkill_336,              //336 上将登场  先制攻击  必用   造成相当于50%的攻击伤害
    enEnemySkill_337,              //337 决一死战  先制攻击   必用   回复玩家100%血量
    enEnemySkill_338,              //338 霸刀。纵斩  重击  必用  造成相当于200%的攻击伤害
    enEnemySkill_339,              //339 霸刀。横斩  封印    血量50%以下时，必用，最多一次  封印全部武将2~6回合
    enEnemySkill_340,              //340 飞将军势  增益  先制攻击 必用  增益，每回合只能对其造成50万伤害上限，持续3回合
    enEnemySkill_341,              //341 圣龙封印   封印   首次出手必用（无暗属性武将不会发动）  封印全部暗属性武将7回合，并且造成相当于100%的攻击伤害
    enEnemySkill_342,              //342 岚之咆哮   宝珠转换+伤害   血量50%以上时 50%几率发动  随机一种宝珠变成水宝珠，并且同时造成80%伤害
    enEnemySkill_343,              //343 龙戟出击   宝珠转换+伤害   血量50%以上时 50%几率发动  随机六颗宝珠变成无效块，并同时造成80%伤害
    enEnemySkill_344,              //344 圣龙觉醒   说话   血量50%以下时，和345”龙戟乱舞“轮流使用 纯说话，什么都不做
    enEnemySkill_345,              //345 龙戟天下   连击   血量50%以下时，和344”圣龙觉醒“轮流使用  连击7次，每次造成相当于100%的攻击伤害
    enEnemySkill_346,              //346 邪龙的戏谑  先制攻击 必用  随机一种宝珠变成无效块  并同时造成10%伤害
    enEnemySkill_347,              //347 邪龙封印    封印  首次出手必用（无光属性武将不会发动）  封印全部光属性武将7回合，并且造成相当于100%的攻击伤害
    enEnemySkill_348,              //348 邪龙的阴谋  宝珠转换+伤害  血量50%以上时，50%几率发动  随机六颗宝珠变成带+号宝珠，并同时造成50%伤害
    enEnemySkill_349,              //349 邪龙吐息    宝珠转换+伤害  血量30%~49%之间时优先必用，和350”龙戟贯通“轮流使用   随机一种宝珠变成暗宝珠，并同时造成100%伤害
    enEnemySkill_350,              //350 龙戟贯通  连击   血量30%~49%之间时优先必用，和349”邪龙吐息“轮流使用   连击2次，每次造成相当于70%的攻击伤害
    enEnemySkill_351,              //351 龙戟灭世   连击   血量29%以下时，必用   连击10次，每次造成相当于100%的攻击伤害
    
    
    
    
    
    enEnemySkill_352,    //352 发怒  增益 40%发动 攻击力变为130%，持续3回合。
    enEnemySkill_353,//353 火之束缚 封印  10%发动  封印所有火系宠物2~4回合，期间不能发动攻击，无法使用主动技能，队长技能失效。技能冷却会正常计算，如果宠物队长技能增加HP上限，则HP上限会立刻减少（当前HP也会随着新上限变化），束缚结束HP上限回复，但当前HP不会回复。
    enEnemySkill_354,//354 连续攻击  连击  10%发动  连击2次，每次造成相当于70%的攻击伤害
    enEnemySkill_355,//355 孤军奋战   增益   当剩下1只敌将时必用  攻击力上升至300%，持续999回合
    enEnemySkill_356,//356  疾风切割   宝珠转换+伤害   70%发动，只发动一次   随机一种宝珠变成木宝珠，并同时造成80%伤害。
    enEnemySkill_357,//357  疾风突刺   重击  先制、必用   造成相当于60%的攻击伤害。
    enEnemySkill_358,//358  五月雨突刺   连击  血量30%以上，70%发动   连击3~4次，每次造成相当于35%的攻击伤害
    enEnemySkill_359,//359  踩踏     重击  血量29%以下隔一回合发动一次  造成相当于10%的攻击伤害
    enEnemySkill_360,//360  猛烈冲击  重击  血量29%以下隔一回合发动一次与踩踏间隔发动   造成相当于200%的攻击伤害
    enEnemySkill_361,//361  先制的地画·蜂鸟  重击  先制，必用   造成相当于150%的攻击伤害。
    enEnemySkill_362,//362  强夺的地画·猴子   宝珠转换+伤害  血量30%以上，按顺序重复使用4个技能（362-365）  随机一种宝珠变成无效块，并同时造成80%伤害。
    enEnemySkill_363,//363  束缚的地画·蜘蛛  封印  血量30%以上发动   封印随机1宠物3回合，期间不能发动攻击，无法使用主动技能，队长技能失效。技能冷却会正常计算，如果宠物队长技能增加HP上限，则HP上限会立刻减少（当前HP也会随着新上限变化）。按顺序重复使用4个技能（362-365）
    enEnemySkill_364,//364  猛袭的地画·秃鹰   连击  血量30%以上发动  连击3次，每次造成相当于50%的攻击伤害。按顺序重复使用4个技能（362-365）
    enEnemySkill_365,//365  狩猎的地画·猎犬   增益  血量30%以上发动   攻击力变为200%，持续3回合。按顺序重复使用4个技能（362-365）
    enEnemySkill_366,//366  重压的地画·鲸鱼   百分比扣血   血量29%以下，按顺序重复使用一下2个技能（366-367）造成玩家当前生命值99%的伤害，该伤害可以使用减伤宠物防御
    enEnemySkill_367,//367  痛恨的地画·泰坦  重击  血量29%以下发动   造成相当于200%的攻击伤害. 按顺序重复使用一下2个技能（366-367）
    enEnemySkill_368,//368  发怒   增益   40%发动  攻击力变为130%，持续3回合。
    enEnemySkill_369,//369  黑暗束缚   封印   10%发动   封印所有暗系宠物2~4回合，期间不能发动攻击，无法使用主动技能，队长技能失效。技能冷却会正常计算，如果宠物队长技能增加HP上限，则HP上限会立刻减少（当前HP也会随着新上限变化），束缚结束HP上限回复，但当前HP不会回复
    enEnemySkill_370,//370  连续攻击  连击  10%发动   连击2次，每次造成相当于70%的攻击伤害
    enEnemySkill_371,//371  重击  百分比扣血  50%发动  造成玩家当前生命值75%的伤害，该伤害可以使用减伤宠物防御
    enEnemySkill_372,//372  百万冲击  重击   血量29%以下，70%发动  造成相当于150%的攻击伤害。
    enEnemySkill_373,//373  妖精的恶作剧  宝珠转换+伤害 先制；之后每隔一回合使用1次  随机一种宝珠变成无效块，并同时造成80%伤害
    enEnemySkill_374,//374  催眠咒  封印  血量25%以下，必用  封印随机2宠物2回合，期间不能发动攻击，无法使用主动技能，队长技能失效。技能冷却会正常计算，如果宠物队长技能增加HP上限，则HP上限会立刻减少（当前HP也会随着新上限变化），束缚结束HP上限回复，但当前HP不会回复。
    enEnemySkill_375,//375  重击   百分比扣血    50%以上，50%发动   造成玩家当前生命值75%的伤害，该伤害可以使用减伤宠物防御
    enEnemySkill_376,//376  举起武器  说话   血量49%以下按顺序重复使用（376、377） 只显示技能名称，无效果
    enEnemySkill_377,//377  十亿冲击  重击   血量49%以下按顺序重复使用（377、376）  造成相当于200%的攻击伤害
    enEnemySkill_378,//378  虚空的眼神  隐藏宝珠 先制，必用   所有宝珠的颜色变成黑色，移动后可恢复原本的颜色
    enEnemySkill_379,//379  水晶之咒光  封印  必用，2回合一次  封印随机2宠物3回合，期间不能发动攻击，无法使用主动技能，队长技能失效。技能冷却会正常计算，如果宠物队长技能增加HP上限，则HP上限会立刻减少（当前HP也会随着新上限变化），束缚结束HP上限回复，但当前HP不会回复。
    enEnemySkill_380,//380  水晶碎击  连击   血量40%以上，70%发动  连击2次，每次造成相当于60%的攻击伤害。
    enEnemySkill_381,//381  神秘的虚光  宝珠转换+伤害  血量39%以下时，若其他技能不发动，此技能必发动  随机一种宝珠变成无效块，并同时造成150%伤害
    enEnemySkill_382,//382  魔导弓  连击  血量75%以下，50%发动   连击4次，每次造成相当于30%的攻击伤害。
    enEnemySkill_383,//383  投枪   重击   血量30%以下，70%发动（只发动一次）  造成相当于160%的攻击伤害。
    enEnemySkill_384,//384  迅猛突进  重击  隔回合发动    造成相当于30%的攻击伤害
    enEnemySkill_385,//385  巨角撞击  重击  隔回合发动   造成相当于150%的攻击伤害。
    enEnemySkill_386,//386  挥击    重击   血量75%以下，40%发动  造成相当于120%的攻击伤害。
    enEnemySkill_387,//387  缝影   封印   血量50%以下，必用，最多一次   封印所有神类宠物3~4回合，期间不能发动攻击，无法使用主动技能，队长技能失效。技能冷却会正常计算，如果宠物队长技能增加HP上限，则HP上限会立刻减少（当前HP也会随着新上限变化），束缚结束HP上限回复，但当前HP不会回复
    enEnemySkill_388,//388  挺身魔枪  连击  血量30%以下，70%发动  连击2次，每次造成相当于80%的攻击伤害。
    enEnemySkill_389,//389  魔导弓   连击  血量75%以下，70%发动   连击4次，每次造成相当于30%的攻击伤害
    enEnemySkill_390,//390  盾牌防御   增益  先制，必用  免疫一切异常状态（如毒、破甲、威吓），持续20回合。。
    enEnemySkill_391,//391  邪圣转换   宝珠转换+伤害  血量30%以下，70%发动  所有暗宝珠变成光宝珠，并同时造成150%伤害。
    enEnemySkill_392,//392  盾击   连击  血量75%以下，70%发动  连击2次，每次造成相当于70%的攻击伤害
    enEnemySkill_393,//393  水枪   封印   HP75%↓：70%发动；最多1次  封印所有火系宠物2~4回合，期间不能发动攻击，无法使用主动技能，队长技能失效。技能冷却会正常计算，如果宠物队长技能增加HP上限，则HP上限会立刻减少（当前HP也会随着新上限变化），束缚结束HP上限回复，但当前HP不会回复。
    enEnemySkill_394,//394  突刺  重击    HP50%↓：70%发动   造成相当于150%的攻击伤害。
    enEnemySkill_395,//395  魔兽的咆哮   封印   必用；最多1次  封印随机3宠物2~4回合，期间不能发动攻击，无法使用主动技能，队长技能失效。技能冷却会正常计算，如果宠物队长技能增加HP上限，则HP上限会立刻减少（当前HP也会随着新上限变化），束缚结束HP上限回复，但当前HP不会回复。
    enEnemySkill_396,//396  迅猛突进  重击  隔回合使用  造成相当于30%的攻击伤害。
    enEnemySkill_397,//397  巨角撞击  重击  隔回合使用  造成相当于150%的攻击伤害。
    enEnemySkill_398,//398  一闪突击  重击  先制  造成相当于80%的攻击伤害。
    enEnemySkill_399,//399  圆月斩   连击  HP50%↓：70%发动  连击3次，每次造成相当于40%的攻击伤害。
    enEnemySkill_400,//400  咆哮   宝珠无效化  先制；必用 随机2种宝珠变化成无效块，无效块消除后只能提供Combo，不产生其他效果。
    enEnemySkill_401,//401  抱抓   封印  HP40%↑：按顺序重复使用以下4个技能（401-404）  封印随机1宠物5回合，期间不能发动攻击，无法使用主动技能，队长技能失效
    enEnemySkill_402,//402  火焰吐息  宝珠转换+伤害   HP40%↑：按顺序重复使用以下4个技能（401-404）  随机一种宝珠变成火宝珠，并同时造成100%伤害。
    enEnemySkill_403,//403  扫尾   连击  HP40%↑：按顺序重复使用以下4个技能（401-404）  连击2次，每次造成相当于55%的攻击伤害。
    enEnemySkill_404,//404  飞扑  宝珠转换+伤害  HP40%↑：按顺序重复使用以下4个技能（401-404）随机一种宝珠变成无效块，并同时造成70%伤害。
    enEnemySkill_405,//405  烈焰吐息  宝珠转换+伤害  HP39%↓，50%发动 随机一种宝珠变成火宝珠，并同时造成135%伤害。
    enEnemySkill_406,//406  抱抓  封印  HP39%↓，25%发动 封印随机1宠物5回合，期间不能发动攻击，无法使用主动技能，队长技能失效
    enEnemySkill_407,//407   愤怒爪击  连击  HP39%↓如果其他技能不发动，必然使用此技能  连击2次，每次造成相当于65%的攻击伤害。
    enEnemySkill_408,//408   在弹弹跳跳着  说话  30%发动  发呆
    enEnemySkill_409,//409   在弹弹跳跳着   说话   10%发动  发呆
    enEnemySkill_410,//410   飞跳  重击  HP70%↓：40%发动   造成相当于120%的攻击伤害。
    enEnemySkill_411,//411   喷墨  隐藏宝珠  40%发动    所有宝珠的颜色变成黑色，移动后可恢复原本的颜色。
    enEnemySkill_412,//412   在弹弹跳跳着   说话   30%发动  发呆
    enEnemySkill_413,//413   飞跳  重击   HP70%↓：40%发动  造成相当于120%的攻击伤害。
    enEnemySkill_414,//414   富山水流  宝珠转换+伤害  50%发动；不会连续使用  随机一种宝珠变成水宝珠，并同时造成120%伤害。
    enEnemySkill_415,//415   体撞   重击   HP70%↓：70%发动   造成相当于130%的攻击伤害。
    enEnemySkill_416,//416   发光  宝珠转换+伤害   HP70%↓：70%发动；不会连续使用   随机一种宝珠变成无效块，并同时造成80%伤害。
    enEnemySkill_417,//417   喷墨  隐藏宝珠   40%发动   所有宝珠的颜色变成黑色，移动后可恢复原本的颜色。
    enEnemySkill_418,//418   煎炸  连击    必用    连击4次，每次造成相当于200%的攻击伤害。
    enEnemySkill_419,//419  富山水流    宝珠转换+伤害   50%发动；不会连续使用   随机一种宝珠变成水宝珠，并同时造成120%伤害。
    enEnemySkill_420,//420   王者的体撞  重击    HP30%↓：70%发动  造成相当于150%的攻击伤害。
    enEnemySkill_421,//421   富山的恩惠     回复   先制；必用  回复玩家生命值100%。
    enEnemySkill_422,//422    花吹雪     宝珠转换+伤害   HP70%↓：隔回合使用  随机一种宝珠变成木宝珠，并同时造成120%伤害。
    enEnemySkill_423,//423    富山旋风    连击  HP30%↓：必用   连击4次，每次造成相当于40%的攻击伤害。  
   
    enEnemySkill_424,              //424 威化饼好味道!          说话   25%发动                     发呆
    enEnemySkill_425,              //425 解开神罗万象之谜！      说话   25%发动                     发呆
    enEnemySkill_426,              //426 封印魔破               重击   必用                       造成相当于200%的攻击伤害。
    enEnemySkill_427,              //427 圣龙族之力             增益   必用                       免疫一切异常状态（如毒、破甲、威吓），持续999回合。
    enEnemySkill_428,              //428 七支刀	              增益   HP70%↓：必用                攻击力变为200%，持续999回合
    enEnemySkill_429,              //429 七天伐刀	              连击   HP30%↓：必用                连击7次，每次造成相当于30%的攻击伤害。
    
    enEnemySkill_430,              //430 奥林匹斯之炎	          增益	必用           	           免疫一切异常状态（如毒、破甲、威吓），持续999回合。
    enEnemySkill_431,              //431 阳光爆裂	              连击	HP50%↓：50%发动	           连击3次，每次造成相当于50%的攻击伤害。
    enEnemySkill_432,              //432 逸鬼刀闪	              重击	先制；必用	               造成相当于80%的攻击伤害
    enEnemySkill_433,              //433 燐涅天冲	              连击	HP50%↓：50%发动	           连击4次，每次造成相当于40%的攻击伤害。
    enEnemySkill_434,              //434 九尾五灵阵	   宝珠转换+伤害	必用；不会连续使用	           随机一种宝珠变成随机宝珠，并同时造成80%伤害。
    enEnemySkill_435,              //435 皇魔五神阵	          增益	先制；必用	               免疫一切异常状态（如毒、破甲、威吓），持续999回合。
    enEnemySkill_436,              //436 光触手	              封印	HP50%↓;必用;最多1次	       封印随机6宠物1~3回合，期间不能发动攻击，无法使用主动技能，队长技能失效
    enEnemySkill_437,              //437 黑暗・冲击波	   宝珠转换+伤害	70%发动	                   随机一种宝珠变成无效块，并同时造成80%伤害。
    enEnemySkill_438,              //438 堕入混沌的黑暗中吧！ 	  说话	HP24%↓：必用；最多一次	       发呆
    enEnemySkill_439,              //439 混沌冲击波	          重击	HP24%↓：必用	               造成相当于300%的攻击伤害
    
    
    enEnemySkill_440,              //440 缝影之术	              封印	HP25%↓：必用；最多1次	       封印随机1宠物5回合，期间不能发动攻击，无法使用主动技能，队长技能失效。
    enEnemySkill_441,              //441 缝影之术	              封印	HP25%↓：必用；最多1次	       封印随机1宠物5回合，期间不能发动攻击，无法使用主动技能，队长技能失效。
    enEnemySkill_442,              //442 缝影之术	              封印	HP25%↓：必用；最多1次	       封印随机1宠物5回合，期间不能发动攻击，无法使用主动技能，队长技能失效。
    enEnemySkill_443,              //443 烟幕	           隐藏宝珠	25%发动	                   所有宝珠的颜色变成黑色，移动后可恢复原本的颜色。
    enEnemySkill_444,              //444 电光火石	           先制攻击	先制	                       先制攻击，造成50%基本攻击力的伤害。
    enEnemySkill_445,              //445 治愈之舞	              回复	先制；必用	               回复玩家生命值100%。
    enEnemySkill_446,              //446 快乐的微笑	          说话	HP100%↑：必用	               发呆
    enEnemySkill_447,              //447 好过份！我生气了！ 	  增益	HP99%↓：必用	               攻击力变为1000%，持续999回合。
    enEnemySkill_448,              //448 最爱的日本伞           连击	HP99%↓：40%	               连击2次，每次造成相当于100%的攻击伤害。
    enEnemySkill_449,              //449 红叶乱舞	      宝珠转换+伤害	如果其他技能不发动，必然使用此技能	   随机一种宝珠变成木宝珠，并同时造成175%伤害。
    
    enEnemySkill_450,              //450 神速	          先制攻击	先制，必用	               先制攻击，造成50%基本攻击力的伤害。
    enEnemySkill_451,              //451 神圣吐息	             连击	HP50%↑：必用	               连击2次，每次造成相当于50%的攻击伤害。
    enEnemySkill_452,              //452 神木作祟	             封印	HP49%↓必用；最多1次	       封印随机3宠物3回合，期间不能发动攻击，无法使用主动技能，队长技能失效
    enEnemySkill_453,              //453 树神龙之吹息	 宝珠转换+伤害	    HP49%↓40%发动	           随机一种宝珠变成木宝珠，并同时造成80%伤害。
    enEnemySkill_454,              //454 神之盖亚吐息	         连击	 HP49%↓ 如果其他技能不发动，必然使用此技能	   连击2次，每次造成相当于75%的攻击伤害。
    enEnemySkill_455,              //455 休想再越... 	         重击	先制；必用	               造成相当于50%的攻击伤害。
    enEnemySkill_456,              //456 孤军奋战	             增益	当剩下1只时必用	           增益，攻击力变为300%，持续999回合。
    enEnemySkill_457,              //457 殴打	        百分比扣血	HP100%↓：按顺序使用以下2个技能（优先发动）	造成玩家当前生命值99%的伤害
    enEnemySkill_458,              //458 愤怒的铁拳	         重击	HP100%↓：按顺序使用以下2个技能（次级发动）	重击，造成相当于200%的攻击伤害。
    enEnemySkill_459,              //459 ..雷池半步！	     隐藏宝珠	    先制；必用	               所有宝珠的颜色变成黑色，移动后可恢复原本的颜色
    
    enEnemySkill_460,              //460 孤军奋战	             增益	当剩下1只时必用	           增益，攻击力变为300%，持续999回合。
    enEnemySkill_461,              //461 切割	             重击	HP100%↓：按顺序使用以下2个技能（优先发动）	造成相当于150%的攻击伤害。
    enEnemySkill_462,              //462 愤怒的铁拳	         重击	HP100%↓：按顺序使用以下2个技能（次级发动）	重击，造成相当于200%的攻击伤害。
    enEnemySkill_463,              //463 诹访之神风	         增益	先制；必用	               增益，免疫一切异常状态（如毒、破甲、威吓），持续999回合。
    enEnemySkill_464,              //464 不可饶恕的篡改 	     增益	HP75%↓：必用	               攻击力变为200%，持续99回合。
    enEnemySkill_465,              //465 锈之藤枝	     宝珠转换+伤害	    必用；不会连续使用	           随机一种宝珠变成无效块，并同时造成130%伤害。
    enEnemySkill_466,              //466 八坂之神刀            连击	HP50%↓：必用	               连击8次，每次造成相当于20%的攻击伤害
    enEnemySkill_467,              //467 神技・天神下凡	     连击	HP24%↓：必用	               连击2次，每次造成相当于325%的攻击伤害
    enEnemySkill_468,              //468 气合蓄力	             蓄力	50%发动	                   下一次攻击造成额外100%伤害
    enEnemySkill_469,              //469 水之束缚 	         封印	10%发动	                   封印所有水系宠物2~4回合，期间不能发动攻击，无法使用主动技能，队长技能失效。
    
    enEnemySkill_470,              //470 叶之束缚	             封印	10%发动	                   封印所有木系宠物2~4回合，期间不能发动攻击，无法使用主动技能，队长技能失效。
    enEnemySkill_471,              //471 火之束缚	             封印	10%发动	                   封印所有火系宠物2~4回合，期间不能发动攻击，无法使用主动技能，队长技能失效。
    enEnemySkill_472,              //472 黑暗束缚  	         封印	25%发动	                   封印所有暗系宠物2~4回合，期间不能发动攻击，无法使用主动技能，队长技能失效
    enEnemySkill_473,              //473 闪光束缚	             封印	25%发动	                   封印所有光系宠物2~4回合，期间不能发动攻击，无法使用主动技能，队长技能失效。
    enEnemySkill_474,              //474 连续攻击 	         连击	10%发动	                   连击2次，每次造成相当于70%的攻击伤害。
    enEnemySkill_475,              //475 治愈	             治疗	HP30%↓：50%发动；最多1次	   治疗，回复50%HP
    enEnemySkill_476,              //476 自动修理	             治疗	HP50%↓：75%发动；最多1次	   治疗，回复40%HP
    enEnemySkill_477,              //477 能量填充	             蓄力	HP25~75%：50%发动	           下一次攻击造成额外200%伤害。
    enEnemySkill_478,              //478 双重束缚	             封印	10%发动	                   封印随机2宠物2~4回合，期间不能发动攻击，无法使用主动技能，队长技能失效。
    enEnemySkill_479,              //479 追击模式	             增益	HP50%↓：必用	               攻击力变为200%，持续5回合。
    
    
    enEnemySkill_480,              //480 红热	     宝珠转换+伤害	    HP25%↑：与火焰刀刃轮流使用	   随机一种宝珠变成火宝珠，并同时造成80%伤害
    enEnemySkill_481,              //481 火焰刀刃	             连击	HP25%↑：与红热轮流使用	       连击2次，每次造成相当于50%的攻击伤害。
    enEnemySkill_482,              //482 过热	     宝珠转换+伤害	    HP24%↓：必用	               随机一种宝珠变成火宝珠，并同时造成160%伤害。
    enEnemySkill_483,              //483 米吉多加农炮 	         连击	HP24%↓：必用	               连击2次，每次造成相当于140%的攻击伤害。
    enEnemySkill_484,              //484 流水激光	     宝珠转换+伤害	    HP25%↑：必用；不用连续使用	   随机一种宝珠变成水宝珠，并同时造成80%伤害。
    enEnemySkill_485,              //485 水之巨矛	             连击	HP25%↑：必用	               连击4次，每次造成相当于25%的攻击伤害。
    enEnemySkill_486,              //486 流水爆发	     宝珠转换+伤害	    HP24%↓：必用	               随机一种宝珠变成水宝珠，并同时造成160%伤害。
    enEnemySkill_487,              //487 冰霜粉碎者 	         连击	HP24%↓：必用	               连击2~5次，每次造成相当于70%的攻击伤害。
    enEnemySkill_488,              //488 气压斩	     宝珠转换+伤害	    HP25%↑：必用；与风刃轮流使用   随机一种宝珠变成木宝珠，并同时造成80%伤害
    enEnemySkill_489,              //489 风刃	             连击	HP25%↑：与气压斩轮流使用	   连击5次，每次造成相当于20%的攻击伤害。
    
    enEnemySkill_490,              //490 航空喷射	     宝珠转换+伤害	    HP24%↓：必用	               随机一种宝珠变成木宝珠，并同时造成160%伤害。
    enEnemySkill_491,              //491 旋风冲击 	         连击	HP24%↓：必用	               连击5次，每次造成相当于50%的攻击伤害。
    enEnemySkill_492,              //492 放电	     宝珠转换+伤害    HP25%↑：与电击斧轮流使用	   随机一种宝珠变成光宝珠，并同时造成80%伤害。
    enEnemySkill_493,              //493 电击斧 	             重击	HP25%↑：HP25%↑：与放电轮流使用	        造成相当于110%的攻击伤害。
    enEnemySkill_494,              //494 迅雷兵器	     宝珠转换+伤害	    HP24%↓：必用	               随机一种宝珠变成光宝珠，并同时造成160%伤害。
    enEnemySkill_495,              //495 皇爪连牙 	         连击	HP24%↓：必用	               连击4次，每次造成相当于70%的攻击伤害。
    enEnemySkill_496,              //496 恐惧攻击	     宝珠转换+伤害	    HP25%↑：50%发动 	  随机一种宝珠变成暗宝珠，并同时造成80%伤害
    enEnemySkill_497,              //497 四重镰刀	             连击	HP25%↑：50%发动    连击4次，每次造成相当于25%的攻击伤害
    enEnemySkill_498,              //498 薄雾影子	     宝珠转换+伤害	    HP24%↓：必用	      随机一种宝珠变成暗宝珠，并同时造成160%伤害。
    enEnemySkill_499,              //499 灭绝飞弹	             连击	HP24%↓：必用	               连击3次，每次造成相当于90%的攻击伤害。
    
    
    
    
    enEnemySkill_500,              //500 熄灭     隐藏宝珠        先制攻击 必用  所有宝珠变为黑色 移动后可恢复
    
    enEnemySkill_501,              //501 燃尽  封印  30%   随机封印玩家的1名光系将领1-3回合
    
    enEnemySkill_502,              //502 善变  宝珠转换+伤害  效果同ID343
    
    
    enEnemySkill_503,              //503 失效   宝珠转换+伤害   效果同ID196
    
    enEnemySkill_504,              //504  森罗地狱   封印    效果同ID324
    
    
    enEnemySkill_505,              //505  抽刀断水  封印  效果同ID114
    
    enEnemySkill_506,           //506   野心  先制攻击  先制攻击 必用  降低玩家HP上限50%
    
    enEnemySkill_507,              //507 假意 宝珠转换+伤害   效果同ID150
    
    enEnemySkill_508,              //508 反骨  下次重击  第一次出手行动时必用  下一次攻击造成99999伤害
    
    enEnemySkill_509,              //509  噬骨  特殊  死亡时必定触发  使玩家损失9999HP
    
    enEnemySkill_510,              //510 宿敌   增益    效果同ID206
    
     enEnemySkill_511,              //511  恶意  宝珠转换+伤害  20%几率发动   将玩家当前屏幕的光珠全部转变为无效块 并造成2万伤害
    
     enEnemySkill_512,              //512 永恒时光 先制攻击  先制攻击 必用  玩家所有将领的主动技能CD延长5回合
    
     enEnemySkill_513,              //513 湮灭星光  重击  HP50%↓：必用  5次连击 每次伤害1万
    
     enEnemySkill_514,              //514 客星倍明  说话  首次出手必用 只是说话
    
     enEnemySkill_515,              //515 主星幽隐 说话  首次出手必用 只是说话
    
     enEnemySkill_516,              //516 华美  封印  60%几率发动  随机封印玩家暗属性武将1人1-3回合
    
     enEnemySkill_517,              //517娇媚      宝珠转换    60%几率发动   所有宝珠变为黑色 移动后可恢复
    
     enEnemySkill_518,              //518高贵  重击  效果同ID4
    
     enEnemySkill_519,              //519献祭  特殊+回复血量   死亡时必定触发 自爆使玩家损失9999血量并回复其他敌将100%血量
    
     enEnemySkill_520,              //520陪葬 特殊  死亡时必定触发  死亡时使玩家损失6666血量
    
     enEnemySkill_521,              //521伏龙  特殊  死亡时必定触发  死亡时使玩家损失7777血量
    
    enEnemySkill_522,              //522潜龙  宝珠转换+伤害  50%几率发动  将玩家除心珠之外的宝珠全部转化为光珠 并造成60%基础伤害

    
     enEnemySkill_523,              //523伤魂  连击  50%几率发动  对玩家造成8888伤害 随机1-3次
    
     enEnemySkill_524,              //524玉碎九重  特殊  死亡时必定触发  死亡时使玩家损失9999生命
    
     enEnemySkill_525,              //525弄权  宝珠转换+伤害  50%几率发动  将玩家的所有暗珠与光珠转变为无效块并造成50%基础伤害
    
     enEnemySkill_526,              //526骄奢  封印  50%HP以下 100%触发  封印玩家所有武将3-5回合 仅此1次
    
     enEnemySkill_527,              //527虚华  连击  50%几率发动  对玩家造成9999伤害 随机1-3次
    
     enEnemySkill_528,              //528冥王之怒  先制攻击  先制攻击 必用  对玩家造成无视防御的1W伤害
    
     enEnemySkill_529,              //529摄魂  连击  30%HP以下100%触发  对玩家造成10000伤害 随机1-3次
    
     enEnemySkill_530,              //530十方俱滅  重击   HP50%↓：必用  连击3次 每次66666伤害
    
     enEnemySkill_531,              //531幻痛  宝珠转换  30%几率触发  随机挑选玩家12颗宝珠转换为无效块
    
     enEnemySkill_532,              //532它很硬   首次出手必用  只是说话
    
     enEnemySkill_533,              //533它比它还硬！   首次出手必用  只是说话
    
     enEnemySkill_534,              //534它虽然不硬…    首次出手必用  只是说话
    
    
    
    
    
    enEnemySkill_Max
};
 
//敌人buff
enum enEnemyBuff
{
    enEnemyBuff_null = 0,
    enEnemyBuff_wudi,           //1 让其他怪无敌
    enEnemyBuff_chenmo,         //2 使玩家武将无法使用技能
    enEnemyBuff_yanchi,         //3 使玩家武将技能CD加倍
    enEnemyBuff_canfei,         //4 使玩家武将总血量减少30%
    enEnemyBuff_mutengjia,      //5 只有火系攻击才能产生攻击
    enEnemyBuff_wenyihuanjing,  //6 当局每回合减HP上限10%(减上限)
    enEnemyBuff_shenfa,         //7 当局开始直至结束禁止复活
    enEnemyBuff_liushuifanshi,  //8 受到火属性攻击后反弹100%水属性伤害，如果攻击导致HP归0则不发动
    enEnemyBuff_shuxinghudun,   //9 每回合切换自身属性一次（水、火、木、光、暗），只有相克属性才能造成伤害
    enEnemyBuff_ysshenyuan,     //10 只有光属性能造成伤害
    enEnemyBuff_ystaipingdao,   //11 只有群攻才能造成伤害
    enEnemyBuff_aytaipingyaoshu,//12 满HP后多余的回血量才能造成伤害
    enEnemyBuff_shengguangdun,  //13 反弹15%的伤害给玩家
    enEnemyBuff_wenyi,          //14 瘟疫,每回合降低玩家当前30%血量,1的时候不降
    enEnemyBuff_hunyuandun,     //15 混元盾,4combo及以上才能造成伤害
    enEnemyBuff_shihunhuo,      //16 噬魂火 吸收火100%回复自身HP
    enEnemyBuff_shihunshui,     //17 噬魂水 吸收水100%回复自身HP
    enEnemyBuff_shihunmu,       //18 噬魂木 吸收木100%回复自身HP
    enEnemyBuff_shihunguang,    //19 噬魂光 吸收光100%回复自身HP
    enEnemyBuff_shihunan,       //20 噬魂暗 吸收暗100%回复自身HP
    enEnemyBuff_wenyi2,         //21 瘟疫2,每回合降低玩家最大血量的30%,会死
    enEnemyBuff_wenyihuanjing2, //22 瘟疫幻境2 当局每回合减当前血量10%
    enEnemyBuff_wenyihuanjing3, //23 瘟疫幻境3 当局每回合减最大血量10%(会死)
    enEnemyBuff_1lianbufan,     //24 1连倍返 受到1COMBO的攻击后强制结束CD，开始攻击，并且攻击力翻倍
    enEnemyBuff_2lianbufan,     //25 2连倍返 受到2COMBO的攻击后强制结束CD，开始攻击，并且攻击力翻倍
    enEnemyBuff_3lianbufan,     //26 3连倍返 受到3COMBO的攻击后强制结束CD，开始攻击，并且攻击力翻倍
    enEnemyBuff_4lianbufan,     //27 4连倍返 受到4COMBO的攻击后强制结束CD，开始攻击，并且攻击力翻倍
    enEnemyBuff_5lianbufan,     //28 5连倍返 受到5COMBO的攻击后强制结束CD，开始攻击，并且攻击力翻倍
    enEnemyBuff_6lianbufan,     //29 6连倍返 受到6COMBO的攻击后强制结束CD，开始攻击，并且攻击力翻倍
    enEnemyBuff_7lianbufan,     //30 7连倍返 受到7COMBO的攻击后强制结束CD，开始攻击，并且攻击力翻倍
    enEnemyBuff_8lianbufan,     //31 8连倍返 受到8COMBO的攻击后强制结束CD，开始攻击，并且攻击力翻倍
    enEnemyBuff_9lianbufan,     //32 9连倍返 受到9COMBO的攻击后强制结束CD，开始攻击，并且攻击力翻倍
    enEnemyBuff_10lianbufan,    //33 10连倍返 受到10COMBO的攻击后强制结束CD，开始攻击，并且攻击力翻倍
    enEnemyBuff_1lianbufan2,    //34 1连倍返 受到1COMBO的攻击后强制结束CD，开始攻击，并且攻击力翻倍
    enEnemyBuff_2lianbufan2,    //35 2连倍返 受到2COMBO的攻击后强制结束CD，开始攻击，并且攻击力翻倍
    enEnemyBuff_3lianbufan2,    //36 3连倍返 受到3COMBO的攻击后强制结束CD，开始攻击，并且攻击力翻倍
    enEnemyBuff_4lianbufan2,    //37 4连倍返 受到4COMBO的攻击后强制结束CD，开始攻击，并且攻击力翻倍
    enEnemyBuff_5lianbufan2,    //38 5连倍返 受到5COMBO的攻击后强制结束CD，开始攻击，并且攻击力翻倍
    enEnemyBuff_6lianbufan2,    //39 6连倍返 受到6COMBO的攻击后强制结束CD，开始攻击，并且攻击力翻倍
    enEnemyBuff_7lianbufan2,    //40 7连倍返 受到7COMBO的攻击后强制结束CD，开始攻击，并且攻击力翻倍
    enEnemyBuff_8lianbufan2,    //41 8连倍返 受到8COMBO的攻击后强制结束CD，开始攻击，并且攻击力翻倍
    enEnemyBuff_9lianbufan2,    //42 9连倍返 受到9COMBO的攻击后强制结束CD，开始攻击，并且攻击力翻倍
    enEnemyBuff_10lianbufan2,   //43 10连倍返 受到10COMBO的攻击后强制结束CD，开始攻击，并且攻击力翻倍
    enEnemyBuff_1combodun,      //44 只有指定Combo数1才能对敌人造成伤害，超过或不足都会使伤害为0
    enEnemyBuff_2combodun,      //45 只有指定Combo数2才能对敌人造成伤害，超过或不足都会使伤害为0
    enEnemyBuff_3combodun,      //46 只有指定Combo数3才能对敌人造成伤害，超过或不足都会使伤害为0
    enEnemyBuff_4combodun,      //47 只有指定Combo数4才能对敌人造成伤害，超过或不足都会使伤害为0
    enEnemyBuff_5combodun,      //48 只有指定Combo数5才能对敌人造成伤害，超过或不足都会使伤害为0
    enEnemyBuff_6combodun,      //49 只有指定Combo数6才能对敌人造成伤害，超过或不足都会使伤害为0
    enEnemyBuff_1combodun2,     //50 只有指定Combo数1才能对敌人造成伤害，超过或不足都会使伤害为0
    enEnemyBuff_2combodun2,     //51 只有指定Combo数2才能对敌人造成伤害，超过或不足都会使伤害为0
    enEnemyBuff_3combodun2,     //52 只有指定Combo数3才能对敌人造成伤害，超过或不足都会使伤害为0
    enEnemyBuff_4combodun2,     //53 只有指定Combo数4才能对敌人造成伤害，超过或不足都会使伤害为0
    enEnemyBuff_5combodun2,     //54 只有指定Combo数5才能对敌人造成伤害，超过或不足都会使伤害为0
    enEnemyBuff_6combodun2,     //55 只有指定Combo数6才能对敌人造成伤害，超过或不足都会使伤害为0
    enEnemyBuff_combodun2,      //56 每次CD0时产生一个数字(3至6) 如该次攻击的COMBO数与该数字相同，BOSS不会发动攻击
    enEnemyBuff_combodun22,     //57 每次CD0时产生一个数字(3至6) 如该次攻击的COMBO数与该数字相同，BOSS不会发动攻击
    enEnemyBuff_combodun3,      //58 进关卡及敌将每次攻击后会随机提供一个Comb数，只有指定Combo数才能对敌人造成伤害，超过或不足都会使伤害为0
    enEnemyBuff_combodun32,     //59 进关卡及敌将每次攻击后会随机提供一个Comb数，只有指定Combo数才能对敌人造成伤害，超过或不足都会使伤害为0
    enEnemyBuff_zhuanzhutime1,  //60 减少转珠时间1秒
    enEnemyBuff_zhuanzhutime2,  //61 减少转珠时间2秒
    enEnemyBuff_shuxinghudun2,  //62 每回合切换自身属性一次（火、水、木、光、暗），只有相克属性才能造成伤害（随机切换）
    enEnemyBuff_63,             //63 快速通信 挪动宝珠时间缩短3s
    enEnemyBuff_64,             //64 神将是什么 神将类造成伤害减半
    enEnemyBuff_65,             //65 复位波 50%发动 防御姿态、属性攻击增幅（北欧神主动技）等技能无效化。
    enEnemyBuff_66,             //66 虚无的波动100%发动 防御姿态、属性攻击增幅（北欧神主动技）等技能无效化。
    
    enEnemyBuff_67,             //67 调换队长和队员的位置
    enEnemyBuff_68,             //68 受到{N}COMBO的攻击后强制结束CD，开始攻击，并且攻击力翻倍
    enEnemyBuff_69,             //69 受到{N}COMBO的攻击时 无效
    
    enEnemyBuff_70,             //70 受到攻击后，如果血量没有归0，造成相当于150%的火属性攻击伤害
    enEnemyBuff_71,             //71 每回合转珠开始前，将我方主将和任意一名副将交换
    enEnemyBuff_72,             //72 每回合转珠开始前，随机封印一名武将的主动技1回合(改成随机封印一名副将)
    enEnemyBuff_73,             //73 只有+宝珠的属性攻击能对其造成伤害，否则为1（如果同时消除3组暗宝珠，并且有一组含有1个暗+宝珠，那么此次暗属性攻击满足条件，造成伤害）
    enEnemyBuff_74,             //74 每回合开始前，随机1种宝珠（不会随机到无效块，毒宝珠等六种基础属性之外的宝珠）变成无效块
    enEnemyBuff_75,             //75 每回合转珠开始前，将我方主将和任意一名副将交换
    enEnemyBuff_76,             //76 只有+宝珠的属性攻击能对其造成伤害，否则为1（如果同时消除3组暗宝珠，并且有一组含有1个暗+宝珠，那么此次暗属性攻击满足条件，造成伤害）

    enEnemyBuff_77,             //77 只有群攻才能造成伤害
    enEnemyBuff_78,             //78 每回合自动回复25%血量 并随机给予玩家1-3次6666伤害的攻击
    enEnemyBuff_79,             //79 效果同ID74
    enEnemyBuff_80,             //80 每回合自动回复25%血量 并随机给予玩家1-3次7777伤害的攻击
    enEnemyBuff_81,             //81 效果同ID72
    enEnemyBuff_82,             //82 使玩家所有武将主动技能CD立即增加5回合
    enEnemyBuff_83,             //83 进入回合起10回合不被击杀，直接自爆造成99999伤害
    
    enEnemyBuff_max
};

//主动技类别
enum enManSkillTp
{
    enManSkillTp_null,
    enManSkillTp_atk,           //攻击系
    enManSkillTp_gravity,       //重力
    enManSkillTp_delay,         //加回合
    enManSkillTp_break,         //破甲
    enManSkillTp_poison,        //毒
    enManSkillTp_sick,          //瘟疫
    enManSkillTp_recover,       //回复
    enManSkillTp_armor,         //加防
    enManSkillTp_stonetrans,    //变宝石
    enManSkillTp_stonerand,     //宝石刷新
    enManSkillTp_luanshi,       //乱世
    enManSkillTp_mabi,          //麻痹
    enManSkillTp_wudi,          //无敌    1.按回合对一个属性；2.按伤害对一个属性；3.按回合对一个属性100%，其他50%；
    enManSkillTp_Enhance,       //x属性加强
    enManSkillTp_StnPlus,       //宝石加强
    enManSkillTp_fanji,         //反击
    enManSkillTp_aoe,           //AOE
    enManSkillTp_chgElm,        //改变怪的属性
    
    enManSkillTp_stoneAtk,      //宝石＊攻击力
    enManSkillTp_EnWuJiangType, //武将类型攻击加强
    enManSkillTp_chglocal,      //与主将交换位置
    enManSkillTp_ReCover_WuJiangType, //武将类型回复力加强
    enManSkillTp_CountryWujiangType,  //国家武将类型攻击增加
    
};

//被动技类别
enum enAutoSkillTp{
    enAutoSkillTp_null,
    enAutoSkillTp_atk,          //攻击系
    enAutoSkillTp_atk2,         //双属性攻击系
    enAutoSkillTp_recover,      //回复
    enAutoSkillTp_burn,         //追打
    enAutoSkillTp_elemburn,     //属性追打(弱点) //shikun?
    enAutoSkillTp_armor_attr,   //单属性防
    enAutoSkillTp_armor_attr2,  //双属性防(效果相同)
    enAutoSkillTp_armor_attr2V2,  //双属性防(效果不同)
    enAutoSkillTp_armor_attr3,  //3属性防 (水火木)
    enAutoSkillTp_armor_all,    //全防
    enAutoSkillTp_revive,       //免死
    enAutoSkillTp_delay,        //延时
    enAutoSkillTp_valChg_hp,    //数值改变(hp)
    enAutoSkillTp_valChg_rcv,   //数值改变(recover)
    enAutoSkillTp_valChg_atkrcv,//数值改变(attack & recvoer)
    enAutoSkillTp_valChg_all,   //数值改变(attack & hp & recvoer)
    enAutoSkillTp_sndChg,       //音乐音效改变
    enAutoSkillTp_fanji,        //反击
    enAutoSkillTp_atk_cmb,       //攻击系(根据combo数)
    enAutoSkillTp_valChg_hp_Elm2,    //数值改变(hp, 双属性)
    enAutoSkillTp_atk_elm_cnt,       //攻击系(根据消除珠子属性数)
    enAutoSkillTp_valChg_hprcv,  //数值改变(hp & recover)
    enAutoSkillTp_atk_elm_type,       //攻击系(根据消除珠子属性类型) cOdds:（0：水火木；1：火光暗；2：水木暗；3：水木光；4：火木光；5：火水暗,6：水光暗，7：木光暗，8:火水光)
    enAutoSkillTp_atk_elm_type4,      //攻击系(根据消除珠子属性类型) cOdds:（0：火水木光；1:水木光暗)
    enAutoSkillTp_valChg_atkhp,  //数值改变(attack & hp)
    enAutoSkillTp_atk_aoe,       //攻击系，aoe触发
    enAutoSkillIp_del_half_time_atk2V2,     //减少一半时间与双属攻击
    enAutoSkillIp_money_exp_drop,     //金钱，经验，掉率增加 金钱倍数＝cElement*fEffect 经验倍数＝cGenTp*fEffect 掉率倍数＝cOdds*fEffect (若cElement或cGenTp或cOdds为0,则该项不起作用)

};

//武将类型
enum enGeneralTp{
    enGeneralTp_Null=0,     //0无限制
    enGeneralTp_GuoShi,     //1国士无双(龙)
    enGeneralTp_GongShou,   //2攻守兼备(平衡系)
    enGeneralTp_ShengSheng, //3生生不息(回复系)
    enGeneralTp_XiaoYong,   //4骁勇善战(攻击)
    enGeneralTp_JinShi,     //5金石之坚(体力系)
    enGeneralTp_God,        //6神将(神)
    enGeneralTp_ZhuanSheng, //7转生道具(进化用)
    enGeneralTp_QiangHua,   //8强化合成(强化合成用)
    enGeneralTp_mojiang,    //9魔将
    enGeneralTp_LongShen,    //10龙&神
   
    enGeneralTp_Invalidbn = 99, //无效类型 99不可更改
};

enum  enCountryTp{
    enCountryTp_Null = 0,     //国别为无
    enCountryTp_dahan,       //国别为汉
    enCountryTp_weiguo,      //国别为魏
    enCountryTp_shuguo,      //国别为蜀
    enCountryTp_wuguo,       //国别为吴
    enCountryTp_qunying,     //国别为群英
    enCountryTp_jindai,      //国别为晋
    enCountryTp_Invalid = 99, //无效类型
};

//主动技能
typedef struct{
    char    cTurn;          //冷却回合
    char    cMaxLv;         //最大lv
    char    cTargetCnt;     //0:攻击单个目标   1: 全体攻击    2:只攻击技能属性相克的属性
    char    cElement;       //技能属性 参考enElementDef
    int     iEffectBase;    //1: 卡牌攻击力  1: 攻击力*fEffect  2: 攻击力*((int)fEffect ~ (fEffect - (int)fEffect) * 1000)  n: 直接对攻击力赋值
                            //2: 敌人HP
                            //3: 敌人攻击力
                            //4: 敌方当前回合数
                            //5: 敌人防御力
                            //6: 玩家回复力
                            //7: 敌方伤害
                            //其他: 常数
                            // 无敌技能：1表示按回合数无敌、2表示按伤害次数无敌

    float   fEffect;        //技能效果    (fEffect = 1,宝石变化中状态，随机变为3个属性)
    char    cContinue;      //持续回合
    
    int     iType;          //技能分类
}stManualSkill;

//被动技能附加息信
class CAutoSkillAppend
{
public:
    CAutoSkillAppend():m_nIfEffectType(0){}
    bool isAppend()const;
    static bool isType(int nIfEffectType,int var){return var==(nIfEffectType & var);}
    
    //武将ID列表
    CAutoSkillAppend & addIfGenIDList(const char *pchCon);
    bool isMustGenIDList()const;
    bool isGenIDList(std::vector<unsigned short> &vrID);
    
    //回复HP
    CAutoSkillAppend & addEffectReplyHp(int nReplyHp);
    bool isReplyHp()const;
    int getReplyHp()const{return m_nReplyHp;}
    
//    /*
//     brief  中毒
//     param[in]  几率
//     param[in]  使用的回合数,0为无限
//     param[in]  使用技能武将攻击力倍数的系数
//     param[in]  使用技能武将属性
//     param[in]  使用技能武将类型
//     */
//    CAutoSkillAppend & addPoison(char chOdds, char chRoundCount = 0,float fGenRate = 0.0f,
//                                 char chElement = enElementMax, char chGenTp = enGeneralTp_Null);
//    bool isPoison()const;
//    char getPoisonOdds()const {return m_chPoisonOdds;}
//    char getPoisonRoundCount()const {return m_chPoisonRoundCount;}
//    float getPoisonGenRate()const {return m_fPoisonGenRate;}
//    char getPoisonElement()const {return m_chPoisonElement;}
//    char getPoisonGenTp()const {return m_chPoisonGenTp;}
    
//    /*
//     brief  冻结
//     param[in]  几率
//     param[in]  使用的回合数,0为无限
//     param[in]  使用技能武将攻击力倍数的系数
//     param[in]  使用技能武将属性
//     param[in]  使用技能武将类型
//     */
//    CAutoSkillAppend & addFreeze(char chOdds, char chRoundCount = 0,float fGenRate = 0.0f,
//                                 char chElement = enElementMax, char chGenTp = enGeneralTp_Null);
//    bool isFreeze()const;
//    char getFreezeOdds()const {return m_chFreezeOdds;}
//    char getFreezeRoundCount()const {return m_chFreezeRoundCount;}
//    float getFreezeGenRate()const {return m_fFreezeGenRate;}
//    char getFreezeElement()const {return m_chFreezeElement;}
//    char getFreezeGenTp()const {return m_chFreezeGenTp;}
    
private:
    struct SAutoSkillAppendCell
    {
        std::vector<std::pair<unsigned short,char> >     vrData;
    };
    std::pair<std::vector<std::pair<SAutoSkillAppendCell,char> >,char>      m_prData;       //指定上阵的武将ID列表
    int                 m_nIfEffectType;
    int                 m_nReplyHp;
//    char                m_chPoisonOdds;
//    char                m_chPoisonRoundCount;
//    float               m_fPoisonGenRate;
//    char                m_chPoisonElement;
//    char                m_chPoisonGenTp;
//    
//    char                m_chFreezeOdds;
//    char                m_chFreezeRoundCount;
//    float               m_fFreezeGenRate;
//    char                m_chFreezeElement;
//    char                m_chFreezeGenTp;
    
};

//被动技能
typedef struct{
    int     iType;          //技能分类
    char    cElement;       //技能属性 参考enElementDef
    char    cGenTp;         //武将类型
    char    cOdds;          //发生几率 cOdds/100
    float   fEffect;        //技能效果
    short   sViceSkid;       //副技能ID
    CAutoSkillAppend    AppendInfo;
}stAutoSkill;

  
enum enManSkillID{
    enManSkill_NULL = 0,
    //攻撃系
    enManSkill_zhuoretuxi,      //1
    enManSkill_huoyantuxi,      //2
    enManSkill_rongyantuxi,     //3
    
    enManSkill_hanlengtuxi,     //4
    enManSkill_hanbingtuxi,     //5
    enManSkill_baoxuetuxi,      //6
    
    enManSkill_liefengtuxi,     //7
    enManSkill_dadituxi,        //8
    enManSkill_gaiyatuxi,       //9
    
    enManSkill_shanguangtuxi,   //10
    enManSkill_leidiantuxi,     //11
    enManSkill_shenshengtuxi,   //12
    
    enManSkill_heiantuxi,       //13
    enManSkill_hunluantuxi,     //14
    enManSkill_diyutuxi,        //15
    
    enManSkill_zhadan,          //16
    enManSkill_nengliangzhadan, //17
    enManSkill_xunjiezhadan,    //18 自身攻击力10倍的伤害，附加20%的几率使敌人攻击延长2回合 这个技能略坑，先特殊处理吧
    enManSkill_baoliezhadan,    //19 对敌方单体造成自身攻击力50倍的伤害，伤害属性与自身属性相同，会受到敌人的属性和防御的影响（原有的30倍调整为50倍，不修改ID）
    
    enManSkill_renengqiu,       //20
    enManSkill_huoyanqiu,       //21
    
    enManSkill_hanlengqiu,      //22
    enManSkill_bingshuangqiu,   //23
    
    enManSkill_liefengqiu,      //24
    enManSkill_dadiqiu,         //25
    
    enManSkill_shanguangqiu,    //26
    enManSkill_leidianqiu,      //27
    
    enManSkill_heianqiu,        //28
    enManSkill_hunluanqiu,      //29
    
    enManSkill_zhongli,         //30
    enManSkill_shiyizhongli,    //31
    
    enManSkill_CuiDu,           //32
    enManSkill_MengDu,          //33
    enManSkill_ShiGuJuDu,       //34
    
    enManSkill_weixia,          //35
    enManSkill_weiya,           //36
    
    enManSkill_fangyupohuai,    //37
    enManSkill_hujiapohuai,     //38
    
    //恢復、輔助系
    enManSkill_zhiliaoshu,      //39
    enManSkill_zhiyushu,        //40
    enManSkill_huichunshu,      //41
    enManSkill_qingnangmishu,   //42
    enManSkill_guiyuanshu,      //43
    enManSkill_mingliaoshu,     //44
    
    enManSkill_baguazhen,       //45
    enManSkill_renwangdun,      //46
    
    //寶石変化系
    enManSkill_HuiFuHuo,        //47
    enManSkill_HuiFuAn,         //48
    enManSkill_HuoHuiFu,        //49
    enManSkill_AnHuiFu,         //50
    enManSkill_ShuiHuo,         //51
    enManSkill_MuShui,          //52
    enManSkill_HuoMu,           //53
    enManSkill_AnGuang,         //54
    enManSkill_GuangAn,         //55
    enManSkill_SuiJi,           //56
    enManSkill_LuanShi,         //57
    enManSkill_LuanShiTX,       //58
    
    //刮骨疗伤
    enManSkill_GuaGuLiaoShang,  //59
    
    //寶石変化系2
    enManSkill_HuiFuShui,       //60 破釜沉舟-水
    enManSkill_HuiFuMu,         //61 破釜沉舟-木
    enManSkill_HuiFuGuang,      //62 破釜沉舟-光
    enManSkill_MuHuiFu,         //63 步步爲營-火
    enManSkill_ShuiHuiFu,       //64 步步爲營-木
    enManSkill_GuangHuiFu,      //65 步步爲營-暗
    
    //猛攻
    enManSkill_FeiDanShui,      //66 20000水伤害
    enManSkill_FeiDanHuo,       //67 20000火伤害
    enManSkill_FeiDanMu,        //68 20000木伤害
    enManSkill_FeiDanGuang,     //69 20000光伤害
    enManSkill_FeiDanAn,        //70 20000暗伤害
    
    //加农炮
    enManSkill_CannonShui,      //71 30000水伤害
    enManSkill_CannonHuo,       //72 30000火伤害
    enManSkill_CannonMu,        //73 30000木伤害
    enManSkill_CannonGuang,     //74 30000光伤害
    enManSkill_CannonAn,        //75 30000暗伤害
    
    //天空龙主动技
    enManSkill_TianKongShui,    //76 冰刃舞
    enManSkill_TianKongHuo,     //77 爆炎击
    enManSkill_TianKongMu,      //78 岩铁碎
    enManSkill_TianKongGuang,   //79 雷龙破
    enManSkill_TianKongAn,      //80 噬魂炮
    
    //麻痹
    enManSkill_MaBiShui,        //81 麻痹(水)
    enManSkill_MaBiHuo,         //82 麻痹(火)
    enManSkill_MaBiMu,          //83 麻痹(木)
    enManSkill_MaBiGuang,       //84 麻痹(光)
    enManSkill_MaBiAn,          //85 麻痹(暗)
    enManSkill_MaBiAll,         //86 麻痹(全)
    
    //无敌
    enManSkill_WuDiShui,        //87 无敌一回合(水)
    enManSkill_WuDiHuo,         //88 无敌一回合(火)
    enManSkill_WuDiMu,          //89 无敌一回合(木)
    enManSkill_WuDiGuang,       //90 无敌一回合(光)
    enManSkill_WuDiAn,          //91 无敌一回合(暗)
    enManSkill_WuDiHurtAll,     //92 无敌一次伤害(全)
    
    enManSkill_RuMuCf,          //93 如沐春风
    enManSkill_HuoShaoLy,       //94 火烧连营
    enManSkill_QiaoBian,        //95 巧变
    enManSkill_JueDiFj,         //96 绝地反击
    enManSkill_GhostCall,       //97 冥王的召唤
    
    //神之怒
    enManSkill_GodAnger,        //98
    
    //宝石变化(火，木-> 心)
    enManSkill_HuoMuXin,        //99
    
    //痛恨一击
    enManSkill_HateAtk,         //100
    
    //瘟疫
    enManSkill_Sick,            //101 使敌方全体感染瘟疫，瘟疫状态的敌人每回合损失相当于
                                //使用技能武将自身攻击力3倍的HP，持续3回合，该伤害无视属性和防御
    
    //超级吐息 攻击系
    enManSkill_rongyantuxi30,     //102
    
    enManSkill_baoxuetuxi30,      //103
    
    enManSkill_gaiyatuxi30,       //104
    
    enManSkill_shenshengtuxi30,   //105
    
    enManSkill_diyutuxi30,        //106
    
    // 两种宝石变成另外两种
    enManSKill_HuoXinMuHuo,         //107 火->心、木->火
    enManSKill_ShuiXinHuoShui,      //108 水->心、火->水
    enManSKill_MuXinShuiMu,         //109 木->心、水->木
    enManSKill_GuangXinAnGuang,    //110 光->心、暗->光
    enManSKill_AnXinGuangAn,           //111 暗->心、光->暗
    
    // 双属性攻击 攻击系
    enManSKill_HuoXinAttack,            //112 火、心属性伤害
    enManSKill_ShuiXinAttack,           //113 水、心属性伤害
    enManSKill_MuXinAttack,             //114 木、心属性伤害
    enManSKill_GuangXinAttack,          //115 光、心属性伤害
    enManSKill_AnXinAttack,             //116 暗、心属性伤害
    
    // 无敌一回合，对一种属性100%，其他属性50%
    enManSkill_WuDiHuoAndAll,             //117 无敌一回合1+5(火）
    enManSkill_WuDiShuiAndAll,            //118 无敌一回合1+5(水)
    enManSkill_WuDiMuAndAll,              //119 无敌一回合1+5(木)
    enManSkill_WuDiGuangAndAll,           //120 无敌一回合1+5(光)
    enManSkill_WuDiAnAndAll,              //121 无敌一回合1+5(暗)
    
    enManSkill_WaterEnhance,            //122 水加强三回合(1.5倍)
    enManSkill_FireEnhance,             //123 火加强三回合(1.5倍)
    enManSkill_WoodEnhance,             //124 木加强三回合(1.5倍)
    enManSkill_LightEnhance,            //125 光加强三回合(1.5倍)
    enManSkill_DarkEnhance,             //126 暗加强三回合(1.5倍)
    
    enManSkill_RcvStnEfct,              //127 1回合内，将木宝珠转化成无效块，且敌人攻击无效（1回合内消除所有宝石等同回复宝石）
    
    enManSkill_1wKeZhi,                 //128 对敌方单体造成10000点伤害，且属性必定克制
    
    enManSkill_SklCdDwn,                //129 1回合内，神将类武将的攻击力提升2.5倍；次回合攻击力减弱(原来是我方技能最大回合-1(本局有效)）
    
    enManSkill_StnPlsShui,              //130 所有水宝石获得加号效果
    enManSkill_StnPlsHuo,               //131 所有火宝石获得加号效果
    enManSkill_StnPlsMu,                //132 所有木宝石获得加号效果
    enManSkill_StnPlsGuang,             //133 所有光宝石获得加号效果
    enManSkill_StnPlsAn,                //134 所有暗宝石获得加号效果
    
    // 相同技能不同名字
    enManSkill_HateAtk_2,               //135 同100 痛恨一击 根据我方HP百分比对敌人单体造成伤害，100%HP时10000点，50%HP时大约20000点，1HP时100000点，受属性加成和敌人防御的影响
    enManSkill_WoodEnhance_2,           //136 同124 木加强一回合(1.5倍)
    enManSkill_HuoShaoLy_2,             //137 同94  火烧连营 3回合内，所有敌人的防御力变为0
    enManSkill_zhongli_2,               //138 同30  对敌方全体造成15%当前HP的伤害，该伤害无视属性和防御
    
    enManSkill_Atk40Huo,               //139   对敌方全体造成自身攻击力40倍的火属性伤害
    enManSkill_Atk40Shui,              //140   对敌方全体造成自身攻击力40倍的水属性伤害
    enManSkill_Atk40Mu,                //141   对敌方全体造成自身攻击力40倍的木属性伤害
    enManSkill_Atk40Guang,             //142   对敌方全体造成自身攻击力40倍的光属性伤害
    enManSkill_Atk40An,                //143   对敌方全体造成自身攻击力40倍的暗属性伤害

    enManSkill_YanChang2,              //144   延长所有敌人攻击冷却2回合

    enManSkill_JiaFang75,              //145   3回合内，受到的所有伤害减少75%

    enManSkill_GuShang9999,            //146   对敌方全体造成9999点固定伤害，该伤害无视属性和防御力
    
    // 相同技能不同名字
    enManSkill_fangyupohuai_2,          //147   同37 5回合内，所有敌人的防御力减少50%
    enManSkill_MengDu_2,                //148   同33 使敌方全体中剧毒，中毒的敌人每回合损失相当于使用技能宠物自身攻击力2倍的HP，持续到死亡，该伤害无视属性和防御

    enManSkill_SuiBianYi6,              //149   6秒内，可以任意挪动宝珠而不会触发消除效果
    
    enManSkill_DanTiAn40,               //150   自身攻击力40倍的暗属性单体攻击
    
    enManSkill_ShuiDaHuo,               //151   对火属性敌人造成37500点水属性伤害
    
    enManSkill_Dan1To50,                //152   对敌方单体造成随机1~50倍伤害，伤害属性与自身属性相同，会受到敌人的属性和防御的影响
    
    // -------------------3.4-----------------------
    enManSkill_Recover3,                //153 回复相当于使用技能宠物自身回复力3倍的HP
    
    enManSkill_AOE3,                    //154 3回合内，所有攻击转化为全体攻击
    
    enManSkill_GodHurt5555,             //155 对敌方全体造成7777点固定伤害，该伤害无视属性和防御力

    enManSkill_Fan5Ji3An,                 //156 5回合内，受到伤害时进行反击，造成3倍于受到伤害的暗属性伤害

    enManSkill_HuoDan30,                //157 对敌方单体造成自身攻击力30倍的火属性伤害

    enManSkill_ShuiDan30,               //158 对敌方单体造成自身攻击力30倍的水属性伤害

    enManSkill_MuDan30,                 //159 对敌方单体造成自身攻击力30倍的木属性伤害

    enManSkill_HuoQuan25000,            //160 对敌方全体造成25000点火属性伤害

    enManSkill_ShuiQuan25000,            //161 对敌方全体造成25000点水属性伤害

    enManSkill_MuQuan25000,            //162 对敌方全体造成25000点木属性伤害

    enManSkill_GuangQuan25000,            //163 对敌方全体造成25000点光属性伤害

    enManSkill_AnQuan25000,            //164 对敌方全体造成25000点暗属性伤害

    enManSkill_GuangDan30,                 //165 对敌方单体造成自身攻击力30倍的光属性伤害

    enManSkill_HuoDaMu17500,            //166 对木属性敌人造成17500点火属性伤害

    enManSkill_ShuiDaHuo17500,            //167 对木属性敌人造成17500点火属性伤害
    
    enManSkill_MuDaShui17500,            //168 对木属性敌人造成17500点火属性伤害

    enManSkill_GuangDaAn15000,              //169   对暗属性敌人造成15000点光属性伤害
    
    enManSkill_AnDaGuang15000,             //170   对光属性敌人造成15000点暗属性伤害
    
    enManSkill_GuangBianHuo,                //171 所有光宝珠变化成火宝珠
    
    enManSkill_AnBianShui,                  //172 所有暗宝珠变化成水宝珠
    
    enManSkill_ShuiBianMu,                  //173 所有水宝珠变化成木宝珠
    
    enManSkill_MuBianGuang,                 //174 所有木宝珠变化成光宝珠
    
    enManSkill_HuoBianAn,                   //175 所有火宝珠变化成暗宝珠
    
    enManSkill_GuaiBianHuo1,                //176 1回合内，把敌将属性转换为火属性
    
    enManSkill_GuaiBianShui1,               //177 1回合内，把敌将属性转换为水属性
    
    enManSkill_GuaiBianMu1,                 //178 1回合内，把敌将属性转换为木属性
    
    enManSkill_GuaiBianAn1,                 //179 1回合内，把敌将属性转换为暗属性
    
    enManSkill_GuaiBianHuo1_2,              //180 同176 1回合内，把敌将属性转换为火属性
    
    // -------------------4.0-----------------------
    enManSkill_Atk20Rcv05,                  //181 對敵方單體造成自身攻擊力20倍的傷害，並回復相當於傷害5%的HP，傷害屬性與自身屬性相同，會受到敵人的屬性和防禦的影響
    
    enManSkill_HP1Atk50,                    //182 HP变为1，并对敌方一体造成50倍光屬性伤害，受屬性加成和敵人防禦的影響 註：已經一HP後，不可發動
    
    enManSkill_SGuangAtk40,                 //183 对敌方单体造成自身攻击力40倍的光属性伤害
    
    enManSkill_ShuiXinBianHuo,              //184 所有水宝珠和回复宝珠变化成火宝珠

    enManSkill_MuXinBianShui,               //185 所有木宝珠和回复宝珠变化成水宝珠

    enManSkill_HuoXinBianMu,                //186 所有火宝珠和回复宝珠变化成木宝珠

    enManSkill_AnXinBianGuang,              //187 所有暗宝珠和回复宝珠变化成光宝珠

    enManSkill_GuangXinBianAn,              //188 所有光宝珠和回复宝珠变化成暗宝珠
    
    enManSkill_AllBianHuo,                  //189 所有宝珠变化为火宝珠
    
    enManSkill_HuoDan30_2,                  //190 对敌方单体造成自身攻击力30倍的火属性伤害

    enManSkill_SuiBianYi7,                  //191 7秒内，可以任意挪动宝珠而不会触发消除效果
    
    enManSkill_Fan3Ji3Guang,                //192 3回合内，必定对攻击的敌人单体反击，造成3倍于受到伤害值的光属性伤害
    
    enManSkill_MuGuangBianXin,              //193 所有木宝珠和光宝珠变化成回复宝珠
    
    enManSkill_HuoAnBianXin,                //194 所有火宝珠和暗宝珠变化成回复宝珠
    
    enManSkill_ShuiGuangBianXin,            //195 所有水宝珠和光宝珠变化成回复宝珠
    
    enManSkill_MuAnBianXin,                 //196 所有木宝珠和暗宝珠变化成回复宝珠
    
    enManSkill_HuoGuangBianXin,             //197 所有火宝珠和光宝珠变化成回复宝珠
    
    enManSkill_HeartEnhance,                //198 1回合内，心属性武将的攻击力变为1.5倍
    
    enManSkill_WuDiXin,                     //199 1回合内敌方心属性攻击无效
    
    enManSkill_HP1Atk50_2,                  //200 HP变为1，并对敌方一体造成50倍光屬性伤害，受屬性加成和敵人防禦的影響 註：已經一HP後，不可發動
    
    enManSkill_GodHurt5555_2,                //201 对敌方全体造成7777点固定伤害，该伤害无视属性和防御力
    
    enManSkill_ShengYan,                      //202 光-火 暗-回复
    
    enManSkill_ShengBing,                      //203 光-水 暗-回复
    
    enManSkill_ShengShu,                      //204 光-木 暗-回复
    
    enManSkill_ShenYu,                      //205 all-回复
    
    enManSkill_FuXiao,                      //206 HP变为1，并且对敌方单体造成300000点暗属性伤害，会受到敌人的属性和防御的影响。当HP为1时不能发动此技能
    
    enManSkill_YanZuZhou,                   //207 5回合内，受到伤害时进行反击，造成3倍于受到伤害的火属性伤害
    
    enManSkill_BingZuZhou,                  //208 5回合内，受到伤害时进行反击，造成3倍于受到伤害的水属性伤害
    
    enManSkill_ShuZuZhou,                   //209 5回合内，受到伤害时进行反击，造成3倍于受到伤害的木属性伤害
    
    enManSkill_LeiZuZhou,                   //210 5回合内，受到伤害时进行反击，造成3倍于受到伤害的光属性伤害
    
    enManSkill_ZuiE,                      //211 对光属性敌人造成150000点暗属性伤害
    
    enManSkill_EndOfWorld,                //212 HP变为1，并且对敌方单体造成自身攻击力300倍的暗属性伤害，会受到敌人的属性和防御的影响。当HP为1时不能发动此技能
    
    enManSkill_ZhuBiTe,                      //213 所有宝珠变为木宝珠
    
    enManSkill_ShenLuWanXiang,               //214 所有光宝珠变为木宝珠，所有回复宝珠变为光宝珠
    
    enManSkill_ShenZhiNu,                      //215 对敌方全体造成35%当前HP的伤害，该伤害无视属性和防御
    
    enManSkill_DarkToLight,                     //216  直接消除暗宝珠造成敌全体光属性伤害，落下后的宝珠不会自动消除，不计算回合数。伤害=自身攻击力×消除宝珠个数×2
    
    enManSkill_OtherToLight,                   //217  直接消除光属性以外的宝珠造成敌方全体光属性伤害，落下后的宝珠不会自动消除，不计算回合数.伤害=自身攻击力×消除宝珠个数×2
    
    enManSkill_MoJiangAtkAdd,                   //218  1回合内魔将类武将攻击增加3倍
    
    enManSkill_219, //219 1回合内，骁勇善战类武将的攻击力提升3倍
    
    enManSkill_220, //220 1回合内，金石之坚类武将的攻击力提升3倍
    
    enManSkill_221, //221 1回合内，攻守兼备类武将的攻击力提升3倍
    
    enManSkill_222, //222 1回合内，生生不息类武将的攻击力提升3倍
    
    enManSkill_223, //223 1回合内，国士无双类武将的攻击力提升2倍
    
    enManSkill_224, //224 1回合内，国士无双类武将的攻击力提升2.5倍
    
    enManSkill_225, //225 木、光属性宝珠的攻击力提升
    
    enManSkill_226, //226 火、暗属性宝珠的攻击力提升
    
    enManSkill_227, //227 与当前自己的主将交换位置，再次使用时换回原位
    
    enManSkill_228, //228对敌方单体造成15000点固定伤害
    
    enManSkill_229, //229对敌方单体造成自身攻击力50倍的火属性伤害
    
    enManSkill_230, //230对敌方单体造成自身攻击力20倍的伤害，并回复相当于伤害10%的HP
    
    enManSkill_231, //231 5秒内，可以任意挪动宝珠
    
    enManSkill_232, //232 所有木宝珠变为水宝珠，所有回复宝珠变为暗宝珠
    
    enManSkill_233, //233 1回合内，骁勇善战类武将的攻击力提升1.5倍
    
    enManSkill_234, //234 2回合内，所受伤害减半
    
    enManSkill_235, //235 对敌方单体造成自身攻击力8倍的伤害，并回复相当于伤害50%的HP
    
    enManSkill_236, //236 HP变为1，并对敌方单体造成30万点水属性伤害
    
    enManSkill_237, //237 所有宝珠变化成火、木、光宝珠
    
    enManSkill_238, //238 所有宝珠变化成水、木、暗宝珠
    
    enManSkill_239, //239 所有宝珠变化成木、光、暗宝珠
    
    enManSkill_240, //240 敌方全体减少20%的血量
    
    enManSkill_241, //241 所有宝珠变化成火、水、暗宝珠
    
    enManSkill_242, //242 回复相当于自身回复力6倍的血量
    
    enManSkill_243, //243 光、暗属性宝珠的攻击力提升
    
    enManSkill_244, //244 对木属性敌人造成75000点火属性伤害
    
    enManSkill_245, //245 对敌方单体造成自身攻击力40倍的光属性伤害
    
    enManSkill_246, //246 所有木宝珠变为火宝珠，所有回复宝珠变为木宝珠
    
    enManSkill_247, //247 所有火宝珠变为水宝珠，所有回复宝珠变为火宝珠
    
    enManSkill_248, //248 所有水宝珠变为木宝珠，所有回复宝珠变为水宝珠
    
    enManSkill_249, //249 所有暗宝珠变为光宝珠，所有回复宝珠变为暗宝珠
    
    enManSkill_250, //250 所有光宝珠变为暗宝珠，所有回复宝珠变为光宝珠
    
    enManSkill_251, //251 水、木属性宝珠的攻击力提升
    
    enManSkill_252, //252 2回合内，攻守兼备类武将的攻击力提升1.5倍
    
    enManSkill_253, //253 对敌方单体造成300点固定伤害
    
    enManSkill_254, //254 与当前自己的主将交换位置，再次使用时换回原位
    
    enManSkill_255, //255 敌人攻击延长2回合；一回合内，火属性大强化（连成横行6颗火属性宝珠，火属性攻击力提升30%）
    
    enManSkill_256, //256 所有暗宝珠变化成水宝珠；水属性宝珠的攻击力提升
    
    enManSkill_257, //257 2回合内，血量完全回复；首回合国士无双类武将变为虚弱状态
    
    enManSkill_258, //258 随机使用下列主动技能:（36威压、58乱世天下、94火烧连营、34蚀骨剧毒、42青囊秘术）
    
    enManSkill_259, //259 随机使用下列主动技能:（124破军点钢矛、224勇者高阶强化、31鬼王咆哮、132蓄势待发·木、213风卷残云）
    
    enManSkill_260, //260 所有宝珠随机变化
    
    enManSkill_261, //  闪光冲击   对敌方单体造成自身攻击力30倍的光属性伤害
    
    enManSkill_262, //  暗黑冲击   对敌方单体造成自身攻击力30倍的暗属性伤害
    enManSkill_263, //  轮回·不灭   血量完全回复;木属性宝珠的攻击力提升
    enManSkill_264, //  神凰鼓舞    4回合内，队伍的回复力变为1.5倍
    enManSkill_265, //  双龙的决心   所有火宝珠变为水宝珠，所有回复宝珠变为木宝珠
    enManSkill_266, //  太后驾到   1回合内，受到的所有伤害减少75%
    enManSkill_267, //  神将解禁   1回合内，神将类武将的攻击力提升2倍
    enManSkill_268, //  死亡禁锢   延长所有敌人攻击冷却1回合
    enManSkill_269, //  方阵      所有暗宝珠变为水宝珠，所有木宝珠变为回复宝珠
    enManSkill_270, //  伪·八阵   所有火宝珠变为木宝珠，所有暗宝珠变为回复宝珠
    enManSkill_271, //  炎之雷纹   火、光属性宝珠的攻击力提升
    enManSkill_272, //  荆州星占   对敌方全体造成随机1~100倍火属性伤害，会受到敌人的属性和防御的影响
    enManSkill_273, //  奇袭·夜   对敌方一体造成自身攻击力x50倍的暗属性伤害并回复15%伤害的HP。会受到敌人的属性和防御的影响
    
    enManSkill_274, //  忠孝两难全	1回合内，火属性武将的攻击力提升2倍
    enManSkill_275, //  忠孝两难全	1回合内，蜀国武将的攻击力提升2倍（等国家系统需求出来再做）
    enManSkill_276, //  大炎戒·炎帝	所有木宝珠变化成火宝珠；10秒内，可以任意挪动宝珠
    enManSkill_277, //  跟得上吗？	1回合内，暗属性武将的攻击力提升2倍
    enManSkill_278, //  双龙偃月刀	所有宝珠变化成光、暗宝珠
    enManSkill_279, //  崩雷圣龙枪	1回合内，光属性武将的攻击力提升2倍；光属性宝珠的攻击力提升
    enManSkill_280, //  名字待定      造成10万点火属性和5万点光属性全体伤害
    
    enManSkill_281, //  双极灭星阵·火暗  所有宝珠变化成火、暗宝珠
    enManSkill_282, //  光耀·神罚的智者之羽  光属性伤害大提高（提高40%等于加4个横排）；10秒内任意移动宝珠
    enManSkill_283, //  双极灭星阵·木暗  所有宝珠变化成木、暗宝珠
    enManSkill_284, //  绝机·子午突袭  一回合内，骁勇善战类武将攻击力提高2倍，使敌方全体中剧毒，中毒的敌人每回合损失相当于使用技能宠物自身攻击力10倍的HP，持续到死亡，该伤害无视属性和防御
    enManSkill_285, //  闪华·救赎的苍天之剑  当回合内，敌将属性变为暗属性；所有宝珠转化为光心
    enManSkill_286, //  VIP的守护    二回合内敌方攻击无效
    enManSkill_287, //  武圣之怒     一回合提升各形态关羽单体伤害2倍（武将ID=191、192、332、333、796、995）。若当前队伍中有多个关羽，则多个关羽伤害均有加成
    enManSkill_288, //   预留
    enManSkill_289, //   预留
    enManSkill_290, //   预留
    enManSkill_291, //   预留
    enManSkill_292, //   明镜止水    1回合内，受到的所有伤害减少35%
    enManSkill_293, //   莲华蔽日    3回合内，受到的所有伤害减少35%
    enManSkill_294, //   黑眼神      1回合内，骁勇善战类宠物的攻击力变为2倍。
    enManSkill_295, //   音速拳      5回合内，攻守兼备类宠物的攻击力变为1.3倍。
    enManSkill_296, //   祈雨        6回合内，受到的所有伤害减少30%
    enManSkill_297, //   十万伏特    1回合内，生生不息类宠物的攻击力变为2倍。
    enManSkill_298, //   光合作用     1回合内，攻守兼备类宠物的攻击力变为2倍。
    enManSkill_299, //   自我暗示    1回合内，金石之坚类宠物的攻击力变为2倍。
    enManSkill_300, //   鲨鱼皮      1回合内，火属性和暗属性宠物的攻击力变为1.5倍
    enManSkill_301, //   闪耀种子      1回合内，木属性和光属性宠物的攻击力变为1.5倍
    enManSkill_302, //    波导弹     对敌方单体造成自身攻击力4倍的伤害，并回复相当于伤害100%的HP，伤害属性与自身属性相同，会受到敌人的属性和防御的影响
    enManSkill_303, //   空间破裂    对敌方单体造成自身攻击力4.5倍的伤害，并回复相当于伤害100%的HP，伤害属性与自身属性相同，会受到敌人的属性和防御的影响
    enManSkill_304, //   火焰漩涡      当前面板上，所有的火属性宝珠获得加号效果，带有加号的宝珠在消除时会造成额外6%伤害。（全屏30个同色加号宝珠时额外伤害为180%，即造成280%伤害）
    enManSkill_305, //   高压水泵    当前面板上，所有的水属性宝珠获得加号效果，带有加号的宝珠在消除时会造成额外6%伤害。（全屏30个同色加号宝珠时额外伤害为180%，即造成280%伤害）
    enManSkill_306, //   种子机枪    当前面板上，所有的木属性宝珠获得加号效果，带有加号的宝珠在消除时会造成额外6%伤害。（全屏30个同色加号宝珠时额外伤害为180%，即造成280%伤害）
    enManSkill_307, //   冥想       6回合内，队伍的回复力变为1.2倍
    enManSkill_308, //   神鸟        5回合内，国士无双类宠物的攻击力变为1.2倍。
    
    enManSkill_Max
};


enum enAutoSkillID{
    enAutoSkill_NULL,
    
    //各种力
    enAutoSkill_JianJiaHuo,     //坚甲厉兵 火 1
    enAutoSkill_JianJiaShui,    //坚甲厉兵 水 2
    enAutoSkill_JianJiaMu,      //坚甲厉兵 木 3
    enAutoSkill_JianJiaGuang,   //坚甲厉兵 光 4
    enAutoSkill_JianJiaAn,      //坚甲厉兵 暗 5
    
    enAutoSkill_JingRuiHuo,     //精锐之师 火 6
    enAutoSkill_JingRuiShui,    //精锐之师 水 7
    enAutoSkill_JingRuiMu,      //精锐之师 木 8
    enAutoSkill_JingRuiGuang,   //精锐之师 光 9
    enAutoSkill_JingRuiAn,      //精锐之师 暗 10
    
    //各种防
    enAutoSkill_JuShouHuo,      //据守 火 11
    enAutoSkill_JuShouShui,     //据守 水 12
    enAutoSkill_JuShouMu,       //据守 木 13
    enAutoSkill_JuShouGuang,    //据守 光 14
    enAutoSkill_JuShouAn,       //据守 暗 15
    
    enAutoSkill_JinTangHuo,     //固若金汤 火 16
    enAutoSkill_JinTangShui,    //固若金汤 水 17
    enAutoSkill_JinTangMu,      //固若金汤 木 18
    enAutoSkill_JinTangGuang,   //固若金汤 光 19
    enAutoSkill_JinTangAn,      //固若金汤 暗 20
    
    //全面防
    enAutoSkill_PanShi,         //磐石 21
    enAutoSkill_MoShou,         //墨守 22

    //加血
    enAutoSkill_NeiJing,        //黄帝内经 23
    enAutoSkill_BenCao,         //神农本草 24
    
    //追打
    enAutoSkill_YeYan,          //业炎 25
    enAutoSkill_YuYan,          //狱炎 26
    
    //免死
    enAutoSkill_Long,           //龙之魄 27
    enAutoSkill_ZhenLong,       //真龙之魄 28
    
    enAutoSkill_YanZhi,         //延滞术 29
    enAutoSkill_ShiGuang,       //时光术 30
    enAutoSkill_YongHeng,       //永恒术 31
    
    //加血
    enAutoSkill_GeYingWuYan,    //歌莺舞燕 32
    enAutoSkill_LuanGeFengWu,   //鸾歌凤舞 33
    
    //追打
    enAutoSkill_WuJinYuYan,     //无尽狱炎 34
    
    //全面防
    enAutoSkill_WuXieKeJi,      //无懈可击 35
    
    enAutoSkill_ZhanShiNu,      //战士之怒 36 (体力类宠物造成的普通攻击伤害变为原本的2倍)
    enAutoSkill_ZhanShiShi,     //猛将血统 37 (平衡类宠物的HP变为原本的1.5倍)
    enAutoSkill_YiNvRongYao,    //百花缭乱 38 (回复类宠物造成的普通攻击伤害变为原本的2倍)
    enAutoSkill_LongXue,        //龙之血   39 (体力类宠物造成的普通攻击伤害变为原本的2.5倍)
    enAutoSkill_LongQiShiShi,   //龙骑士之誓 40 (龙类宠物的HP变为原本的2倍)
    enAutoSkill_LongQiShiNu,    //龙骑士之怒 41 (龙类宠物造成的普通攻击伤害变为原本的2.5倍)
    enAutoSkill_SiKaHa,         //斯卡哈的祈祷 42 (平衡类宠物的HP变为原本的2.5倍)
    enAutoSkill_BuSiNiao,       //不死鸟的加护 43 (平衡类宠物的回复力变为原来的2.5倍)
    enAutoSkill_LangPaoXiao,    //神狼的咆哮 44 (平衡类宠物造成的普通攻击变为原来的2.5倍)
    enAutoSkill_WaErJiLi,       //瓦尔基里之魂 45 (回复类宠物造成的普通攻击伤害变为原本的2.5倍)
    enAutoSkill_ShenDaoYan,     //神之祷言 46 (神类宠物造成的普通攻击变为原来的2倍)
    
    //掉金率
    enAutoSkill_Money15,        //47 掉金率1.5倍
    enAutoSkill_Money20,        //48 掉金率2倍
    
    //经验
    enAutoSkill_Exp12,          //49 经验1.2倍
    enAutoSkill_Exp15,          //50 经验1.5倍
    
    //掉将率
    enAutoSkill_Card12,         //51 武将掉率1.2倍
    enAutoSkill_Card15,         //52 武将掉率1.5倍
    
    //对应属性hp加成
    enAutoSkill_ShuiHp15,       //53 水1.5倍 (水之魂)
    enAutoSkill_HuoHp15,        //54 火1.5倍 (火之魂)
    enAutoSkill_MuHp15,         //55 木1.5倍 (木之魂)
    enAutoSkill_GuangHp15,      //56 光1.5倍 (光之魂)
    enAutoSkill_AnHp15,         //57 暗1.5倍 (暗之魂)
    enAutoSkill_ShuiHp20,       //58 水2倍 (葵水之精)
    enAutoSkill_HuoHp20,        //59 火2倍 (离火之精)
    enAutoSkill_MuHp20,         //60 木2倍 (甲木之精)
    enAutoSkill_GuangHp20,      //61 光2倍 (圣光之命)
    enAutoSkill_AnHp20,         //62 暗2倍 (幽冥之命)
    
    //江南style
    enAutoSkill_JiangNan,       //63 江南style
    
    //激运
    enAutoSkill_JiYun,          //64 金石之坚类武将的HP变为原本的2倍
    
    enAutoSkill_Huo25,          //65 火属性武将造成的普通攻击伤害变为原本的2.5倍
    enAutoSkill_Shui25,         //66 水属性武将造成的普通攻击伤害变为原本的2.5倍
    enAutoSkill_Mu25,           //67 木属性武将造成的普通攻击伤害变为原本的2.5倍
    enAutoSkill_Guang25,        //68 光属性武将造成的普通攻击伤害变为原本的2.5倍
    enAutoSkill_An25,           //69 暗属性武将造成的普通攻击伤害变为原本的2.5倍
    
    //50%~80%几率发动,同属性武将造成的普通攻击伤害变为原本的3倍
    enAutoSkill_FireAtk3,       //70
    enAutoSkill_WaterAtk3,      //71
    enAutoSkill_WoodAtk3,       //72
    enAutoSkill_LightAtk3,      //73
    enAutoSkill_DarkAtk3,       //74
    
    //30%~50%几率发动,同属性武将造成的普通攻击伤害变为原本的4倍
    enAutoSkill_FireAtk4,       //75
    enAutoSkill_WaterAtk4,      //76
    enAutoSkill_WoodAtk4,       //77
    enAutoSkill_LightAtk4,      //78
    enAutoSkill_DarkAtk4,       //79
    
    //xx之魂
    enAutoSkill_FireSoul,       //80  火属性武将的攻击力和回复力变为1.5倍
    enAutoSkill_WaterSoul,      //81  水属性武将的攻击力和回复力变为1.5倍
    enAutoSkill_WoodSoul,       //82  木属性武将的攻击力和回复力变为1.5倍
    enAutoSkill_FireSoulBig,    //83  火属性武将的攻击力、血量和回复力变为1.5倍
    enAutoSkill_WaterSoulBig,   //84  水属性武将的攻击力、血量和回复力变为1.5倍
    enAutoSkill_WoodSoulBig,    //85  木属性武将的攻击力、血量和回复力变为1.5倍
    
    //龙神的xx
    enAutoSkill_DragonGodHp15,  //86  国士无双和神将类武将的HP提升1.5倍
    enAutoSkill_DragonGodHp2,   //87  国士无双和神将类武将的HP提升2倍
    enAutoSkill_DragonGodAtk15, //88  国士无双和神将类武将造成的伤害提升1.5倍
    enAutoSkill_DragonGodAtk2,  //89  国士无双和神将类武将造成的伤害提升2倍
    
    //属性反击
    enAutoSkill_HuoFanji,       //90 火焰反击
    enAutoSkill_ShuiFanji,      //91 冻结反击
    enAutoSkill_MuFanji,        //92 岩石反击
    enAutoSkill_GuangFanji,     //93 闪电反击
    enAutoSkill_AnFanji,        //94 黑暗反击
    
    //Teddy & Zeus
    enAutoSkill_Teddy,          //95 Teddy
    enAutoSkill_Zeus,           //96 Zeus
    
    //双属性防
    enAutoSkill_ArmorHuoMu30,       //97 火和木属性敌人造成的伤害减少30%
    enAutoSkill_ArmorHuoMu50,       //98 火和木属性敌人造成的伤害减少50%
    enAutoSkill_ArmorShuiHuo30,     //99 水和火属性敌人造成的伤害减少30%
    enAutoSkill_ArmorShuiHuo50,     //100 水和火属性敌人造成的伤害减少50%
    enAutoSkill_ArmorMuShui30,      //101 木和水属性敌人造成的伤害减少30%
    enAutoSkill_ArmorMuShui50,      //102 木和水属性敌人造成的伤害减少50%
    enAutoSkill_ArmorGuangHuo30,    //103 光和火属性敌人造成的伤害减少30%
    enAutoSkill_ArmorGuangHuo50,    //104 光和火属性敌人造成的伤害减少50%
    enAutoSkill_ArmorAnMu30,        //105 暗和木属性敌人造成的伤害减少30%
    enAutoSkill_ArmorAnMu50,        //106 暗和木属性敌人造成的伤害减少50%
    enAutoSkill_ArmorHuoAn30,       //107 火和暗属性敌人造成的伤害减少30%
    enAutoSkill_ArmorHuoAn50,       //108 火和暗属性敌人造成的伤害减少50%
    enAutoSkill_ArmorShuiAn30,      //109 水和暗属性敌人造成的伤害减少30%
    enAutoSkill_ArmorShuiAn50,      //110 水和暗属性敌人造成的伤害减少50%
    enAutoSkill_ArmorMuGuang30,     //111 木和光属性敌人造成的伤害减少30%
    enAutoSkill_ArmorMuGuang50,     //112 木和光属性敌人造成的伤害减少50%
    enAutoSkill_ArmorGuangShui30,   //113 光和水属性敌人造成的伤害减少30%
    enAutoSkill_ArmorGuangShui50,   //114 光和水属性敌人造成的伤害减少50%
    enAutoSkill_ArmorGuangAn30,     //115 暗和光属性敌人造成的伤害减少30%
    enAutoSkill_ArmorGuangAn50,     //116 暗和光属性敌人造成的伤害减少50%
    enAutoSkill_ArmorXinHuo30,      //117 心和火属性敌人造成的伤害减少30%
    enAutoSkill_ArmorXinHuo50,      //118 心和火属性敌人造成的伤害减少50%
    enAutoSkill_ArmorXinShui30,     //119 心和水属性敌人造成的伤害减少30%
    enAutoSkill_ArmorXinShui50,     //120 心和水属性敌人造成的伤害减少50%
    enAutoSkill_ArmorXinMu30,       //121 心和木属性敌人造成的伤害减少30%
    enAutoSkill_ArmorXinMu50,       //122 心和木属性敌人造成的伤害减少50%
    enAutoSkill_ArmorXinGuang30,    //123 心和光属性敌人造成的伤害减少30%
    enAutoSkill_ArmorXinGuang50,    //124 心和光属性敌人造成的伤害减少50%
    enAutoSkill_ArmorXinAn30,       //125 心和暗属性敌人造成的伤害减少30%
    enAutoSkill_ArmorXinAn50,       //126 心和暗属性敌人造成的伤害减少50%
    
    //双属性攻击提升
    enAutoSkill_AtkXinHuo15,        //127 心和火属性武将造成的普通攻击伤害变为原本的1.5倍
    enAutoSkill_AtkXinHuo20,        //128 心和火属性武将造成的普通攻击伤害变为原本的2倍
    enAutoSkill_AtkXinShui15,       //129 心和水属性武将造成的普通攻击伤害变为原本的1.5倍
    enAutoSkill_AtkXinShui20,       //130 心和水属性武将造成的普通攻击伤害变为原本的2倍
    enAutoSkill_AtkXinMu15,         //131 心和木属性武将造成的普通攻击伤害变为原本的1.5倍
    enAutoSkill_AtkXinMu20,         //132 心和木属性武将造成的普通攻击伤害变为原本的2倍
    enAutoSkill_AtkXinGuang15,      //133 心和光属性武将造成的普通攻击伤害变为原本的1.5倍
    enAutoSkill_AtkXinGuang20,      //134 心和光属性武将造成的普通攻击伤害变为原本的2倍
    enAutoSkill_AtkXinAn15,         //135 心和暗属性武将造成的普通攻击伤害变为原本的1.5倍
    enAutoSkill_AtkXinAn20,         //136 心和暗属性武将造成的普通攻击伤害变为原本的2倍
    
    //弱点
    enAutoSkill_RuodianHuo,         //137 回合结束后，火属性武将全体对木属性敌人造成300%的属性伤害，
                                    //受到防御力减免，最低伤害为0，没有产生消除的话不会触发该效果
    enAutoSkill_RuodianShui,        //138 回合结束后，水属性武将全体对火属性敌人造成300%的属性伤害，
                                    //受到防御力减免，最低伤害为0，没有产生消除的话不会触发该效果
    enAutoSkill_RuodianMu,          //139 回合结束后，木属性武将全体对水属性敌人造成300%的属性伤害，
                                    //受到防御力减免，最低伤害为0，没有产生消除的话不会触发该效果
    enAutoSkill_RuodianGuang,       //140 回合结束后，光属性武将全体对暗属性敌人造成300%的属性伤害，
                                    //受到防御力减免，最低伤害为0，没有产生消除的话不会触发该效果
    enAutoSkill_RuodianAn,          //141 回合结束后，暗属性武将全体对光属性敌人造成300%的属性伤害，
                                    //受到防御力减免，最低伤害为0，没有产生消除的话不会触发该效果
    
    //神佑
    enAutoSkill_GodBless,           //142 金石之坚类武将造成的普通攻击变为原来的2倍，且每回合回复总血量10%的HP
    
    //水火木三防
    enAutoSkill_3Armor50,           //143 火水木三种属性敌人造成的伤害减少50%
    
    //欺压
    enAutoSkill_QiYa,               //144 回合结束后，对战场上最虚弱的（剩余血量百分比，如果全部满血则攻击左起第一个）
                                    //敌方单位造成1000%的伤害，该伤害不受属性影响，但受到防御力减免，最低伤害为0，没有产生消除的话不会触发该效果
    
    //冥王的邀请
    enAutoSkill_GhostInvite,        //145 我方全体造成的普通攻击伤害变为原本的2倍,且每回合回复相当于自身HP50%的HP
    
    //瘟疫离宫
    enAutoSkill_AtkSick,            //146 对瘟疫状态敌人造成的普通攻击伤害变为原来的3倍
    
    //限界突破
    enAutoSkill_Xjtp,               //147 龙之魄技能效果+攻击后，回复相当于自身攻击力的HP
    
    //各种有暴击的力
    enAutoSkill_JingRuiCritHuo,     //148 精锐之师 暴击 火
    enAutoSkill_JingRuiCritShui,    //149 精锐之师 暴击 水
    enAutoSkill_JingRuiCritMu,      //150 精锐之师 暴击 木
    enAutoSkill_JingRuiCritGuang,   //151 精锐之师 暴击 光
    enAutoSkill_JingRuiCritAn,      //152 精锐之师 暴击 暗
    
    // xx之魂 对应属性的武将攻击力和回复力翻倍
    enAutoSkill_LightSoul,          //153  光属性武将的攻击力和回复力变为1.5倍
    enAutoSkill_DarkSoul,           //154  暗属性武将的攻击力和回复力变为1.5倍
    
    enAutoSkill_FireSoulMore,       //155  火属性武将的攻击力和回复力变为2倍
    enAutoSkill_WaterSoulMore,      //156  水属性武将的攻击力和回复力变为2倍
    enAutoSkill_WoodSoulMore,       //157  木属性武将的攻击力和回复力变为2倍
    enAutoSkill_LightSoulMore,      //158  光属性武将的攻击力和回复力变为2倍
    enAutoSkill_DarkSoulMore,       //159  暗属性武将的攻击力和回复力变为2倍
    
    // 对应属性武将hp翻倍
    enAutoSkill_HuoHp25,             //160 火 HP 2.5倍
    enAutoSkill_ShuiHp25,            //161 水 HP 2.5倍
    enAutoSkill_MuHp25,              //162 木 HP 2.5倍
    enAutoSkill_GuangHp25,           //163 光 HP 2.5倍
    enAutoSkill_AnHp25,              //164 暗 HP 2.5倍

    enAutoSkill_GodAtk25,           //165  水系武将和神将类武将造成的伤害提升2.5倍
    
    enAutoSkill_ManHpArmor,         //166  满血状态下，受到伤害减少80%
    
    enAutoSkill_ZhuiDaKeZhi,         //167  属性克制的追打
    
    enAutoSkill_ZeusSuper,              //168 宙斯技能升级版，1血4倍攻
    
    // 相同技能不同名字
    enAutoSkill_WoodSoul_2,             //169 同82   木属性武将的攻击力和回复力变为1.5倍
    enAutoSkill_GeYingWuYan_2,          //170 同32   歌莺舞燕 每回合回复相当于队长宠物自身回复力300%的HP，没有产生消除的话不会触发该效果
    enAutoSkill_ShiGuang_2,             //171 同30   时光术 宝石移动的最大时限延长较多
    enAutoSkill_LongQiShiNu_2,          //172 同41   龙骑士之怒 龙类宠物造成的普通攻击伤害变为原本的2.5倍
    enAutoSkill_YuYan_2,                //173 同26   每回合对所有敌人造成相当于队长宠物自身攻击力200%的伤害，该伤害不受属性影响，但受到防御力减免，最低伤害为0，没有产生消除的话不会触发该效果
    enAutoSkill_BenCao_2,               //174 同24   每回合回复相当于队长宠物自身回复力200%的HP，没有产生消除的话不会触发该效果
    
    enAutoSkill_FanJiHuo5,              //175   受到伤害时，有约50%几率进行反击，造成5倍于受到伤害的火属性伤害
    
    enAutoSkill_Hp10Attack3,            //176   当HP不足30%时，攻击力变为原本的3倍

    // 双属性防，两种属性防的效果不同
    enAutoSkill_Huo60An40,              //177   火属性减伤60%，暗属性减伤40%
    enAutoSkill_Shui60An40,             //178   水属性减伤60%，暗属性减伤40%
    enAutoSkill_Mu60An40,               //179   木属性减伤60%，暗属性减伤40%
    enAutoSkill_Guang60Shui40,          //180   光属性减伤60%，水属性减伤40%
    enAutoSkill_An60Guang40,            //181   暗属性减伤60%，光属性减伤40%

    // 相同技能不同名字
    enAutoSkill_Money20_2,              //182   同48 掉金率2倍
    
    enAutoSkill_Heart25,                //183 心属性武将造成的普通攻击伤害变为原本的2.5倍
    
    // -----------3.4---------------
    enAutoSkill_MoShou_2,               //184 同22 墨守 受到的所有伤害减少20%
    
    enAutoSkill_Cmb7Atk35,              //185 连击达到7 Combos以上时，所有武将的攻击力变为4.0倍

    enAutoSkill_ShuiMuHP2,              //186 木属性和水属性武将的HP变为2倍
    
    enAutoSkill_XiaoYongAtk2,           //187 骁勇善战类武将的攻击力变为2倍
    
    enAutoSkill_Elm4Atk3,               //188 4种属性同时攻击时，所有武将的攻击力变为3.5倍
    
    enAutoSkill_Elm3Atk25,              //189 3种属性同时攻击时，所有武将的攻击力变为3.0倍

    enAutoSkill_Cmb5Atk25,              //190 连击达到4 Combos以上时，所有武将的攻击力变为2.5倍

    enAutoSkill_Elm5Atk4,               //191 5种属性同时攻击时，所有武将的攻击力变为5倍

    enAutoSkill_Cmb10Atk7,              //192 连击达到10 Combos以上时，所有武将的攻击力变为10倍
    
    // 相同技能不同名字
    enAutoSkill_FireSoulMore_2,         //193 同155  火属性武将的攻击力和回复力变为2倍
    enAutoSkill_WaterSoulMore_2,        //194 同156  水属性武将的攻击力和回复力变为2倍
    enAutoSkill_WoodSoulMore_2,         //195 同157  木属性武将的攻击力和回复力变为2倍
    enAutoSkill_LightSoulMore_2,        //196 同158  光属性武将的攻击力和回复力变为2倍
    enAutoSkill_DarkSoulMore_2,         //197 同159  暗属性武将的攻击力和回复力变为2倍
    
    enAutoSkill_HuoHPRcv2,              //198 火属性武将的HP和回复力变为2倍

    enAutoSkill_ShuiHPRcv2,             //199 水属性武将的HP和回复力变为2倍
    
    enAutoSkill_MuHPRcv2,               //200 木属性武将的HP和回复力变为2倍
    
    enAutoSkill_Cmb3Atk2,               //201 连击达到3Combos以上时，所有武将的攻击力变为2倍
    
    enAutoSkill_YuYan_3,                //202 同26 每回合对所有敌人造成相当于队长武将自身攻击力200%的伤害，该伤害不受属性影响，但受到防御力减免，最低伤害为0，没有产生消除的话不会触发该效果

    enAutoSkill_MoShou_3,               //203 同22 墨守 受到的所有伤害减少20%

    enAutoSkill_HuoShuiMuAtk2,          //204 火、水、木同时攻击时，所有武将的攻击力变为2.5倍
    
    enAutoSkill_GuangFanji_2,           //205 同93 闪电反击 受到伤害时，有约50%几率进行反击，造成5倍于受到伤害的光属性伤害
    
    enAutoSkill_JinTangAn_2,            //206 同20 固若金汤 暗 暗属性敌人造成的伤害减少50%
    
    enAutoSkill_GongShouAtkRcv15,        //207 攻守兼备类武将的攻击力和回复力变为1.5倍

    enAutoSkill_GongShouAtkRcvHp15,     //208 攻守兼备类武将的HP、攻击力和回复力变为1.5倍
    
    enAutoSkill_HuoAtk25Armor20,        //209 我方火属性武将的攻击力提升2.5倍，且木属性减伤20%

    enAutoSkill_ShuiAtk25Armor20,       //210 我方水属性武将的攻击力提升2.5倍，且火属性减伤20%
    
    enAutoSkill_MuAtk25Armor20,         //211 我方木属性武将的攻击力提升2.5倍，且水属性减伤20%

    enAutoSkill_GuangAtk25Armor20,      //212 我方光属性武将的攻击力提升2.5倍，且暗属性减伤20%

    enAutoSkill_AnAtk25Armor20,         //213 我方暗属性武将的攻击力提升2.5倍，且光属性减伤20%

    enAutoSkill_HuoAtk25Burn25,         //214 我方火属性武将的攻击力提升2.5倍，且每回合对所有敌人造成相当于队长武将自身攻击力300%（上调至500%）的伤害，该伤害不受属性影响，但受到防御力减免，最低伤害为0，没有产生消除的话不会触发该效果
    
    enAutoSkill_ShuiAtk25Revive70,      //215 我方水属性武将的攻击力提升2.5倍，且当受到一次攻击使你致死时，如果受到攻击前HP为总HP的70%（改为50%）或以上的话，你将会以1点HP生还
    
    enAutoSkill_MuAtk25Armor15,         //216 我方木属性武将的攻击力提升2.5倍，且火水木属性减伤15%（改为33%）
    
    enAutoSkill_GuangAtk25Recover300,   //217 我方光属性武将的攻击力提升2.5倍，且每回合回复相当于主将自身回复力300%的HP，没有产生消除的话不会触发该效果
    
    enAutoSkill_AnAtk25Delay3,          //218 我方暗属性武将的攻击力提升2.5倍，且宝石移动的最大时限加3秒
    
    enAutoSkill_HuoAtk25HPRcv15,        //219 我方火属性武将的攻击力提升2.5倍，且火属性武将的HP和回复力提升1.5倍

    enAutoSkill_ShuiAtk25HPRcv15,       //220 我方水属性武将的攻击力提升2.5倍，且水属性武将的HP和回复力提升1.5倍

    enAutoSkill_MuAtk25HPRcv15,         //221 我方木属性武将的攻击力提升2.5倍，且木属性武将的HP和回复力提升1.5倍

    enAutoSkill_GuangAtk25Fan25Ji10,    //222 我方光属性武将的攻击力提升2.5倍，且受到伤害时，有约25%几率进行反击，造成10倍于受到伤害的光属性伤害
    
    enAutoSkill_AnAtk25Fan25Ji10,       //223 我方暗属性武将的攻击力提升2.5倍，且受到伤害时，有约25%几率进行反击，造成10倍于受到伤害的暗属性伤害
    
    enAutoSkill_HuoAtk25Rcv2,           //224 我方火属性武将的攻击力提升2.5倍，且火属性武将的回复力提升2倍

    enAutoSkill_ShuiAtk25Rcv2,           //225 我方水属性武将的攻击力提升2.5倍，且水属性武将的回复力提升2倍

    enAutoSkill_MuAtk25Rcv2,           //226 我方木属性武将的攻击力提升2.5倍，且木属性武将的回复力提升2倍

    enAutoSkill_GuangAtk25Rcv2,         //227 我方光属性武将的攻击力提升2.5倍，且光属性武将的回复力提升2倍

    enAutoSkill_AnAtk25Rcv2,           //228 我方暗属性武将的攻击力提升2.5倍，且暗属性武将的回复力提升2倍

    enAutoSkill_GongShouAtk15,          //229 攻守兼备类武将的攻击力变为1.5倍

    enAutoSkill_GongShouAtkHp2,         //230 攻守兼备类武将的HP和攻击力变为2倍
    
    enAutoSkill_ShengShengAtkRcv15,     //231 生生不息类武将的攻击力和回复力变为1.5倍
    
    enAutoSkill_ShengShengAll15,        //232 生生不息类武将的HP、攻击力和回复力变为1.5倍

    enAutoSkill_XiaoYongAtk15,          //233 骁勇善战类武将的攻击力变为1.5倍
    
    enAutoSkill_XiaoYongAtkHp2,         //234 骁勇善战类武将的HP和攻击力变为2倍

    enAutoSkill_JinShiAtkRcv15,         //235 金石之坚类武将的攻击力和回复力变为1.5倍
    
    enAutoSkill_JinShiAll15,            //236 金石之坚类武将的HP、攻击力和回复力变为1.5倍

    enAutoSkill_XiaoYongAtkRcv15,       //237 骁勇善战类武将的攻击力和回复力变为1.5倍
    
    enAutoSkill_XiaoYongAll15,          //238 骁勇善战类武将的HP、攻击力和回复力变为1.5倍

    enAutoSkill_HuoAOEAtk25,          //239 发动火属性群攻时，我方火属性武将的攻击力提升2.5倍

    enAutoSkill_ShuiAOEAtk25,          //240 发动水属性群攻时，我方水属性武将的攻击力提升2.5倍

    enAutoSkill_MuAOEAtk25,          //241 发动木属性群攻时，我方木属性武将的攻击力提升2.5倍

    enAutoSkill_AnAOEAtk25,          //242 发动暗属性群攻时，我方暗属性武将的攻击力提升2.5倍

    enAutoSkill_20HpArmor80,          //243  当HP不足20%时，受到的所有伤害减少80%
    
    enAutoSkill_HuoAtk25Fan25Ji10,    //244 我方火属性武将的攻击力提升2.5倍，且受到伤害时，有约25%几率进行反击，造成10倍于受到伤害的火属性伤害
    
    enAutoSkill_ShuiAtk25Fan25Ji10,    //245 我方水属性武将的攻击力提升2.5倍，且受到伤害时，有约25%几率进行反击，造成10倍于受到伤害的水属性伤害

    enAutoSkill_MuAtk25Fan25Ji10,    //246 我方木属性武将的攻击力提升2.5倍，且受到伤害时，有约25%几率进行反击，造成10倍于受到伤害的木属性伤害

    enAutoSkill_HuoAndGongShouAtk25,  //247 我方火属性和攻守兼备类武将的攻击力提升2.5倍
    
    enAutoSkill_ShuiAndJinShiAtk25,     //248 我方水属性和金石之坚类武将的攻击力提升2.5倍
    
    enAutoSkill_MuAndGuoShiAtk25,       //249 我方木属性和国士无双类武将的攻击力提升2.5倍
    
    enAutoSkill_GuangAndShenAtk25,      //250 我方光属性和神将类武将的攻击力提升2.5倍
    
    enAutoSkill_AnAndShengShengAtk25,   //251 我方暗属性和生生不息类武将的攻击力提升2.5倍
    
    // -------------------4.0-----------------------
    enAutoSkill_YanZhi_2,               //252 同29 宝石移动的最大时限延长少许(5.0)
    
    enAutoSkill_HuoAndJinShiAtk2,       //253 火属性和金石之坚类武将的攻击力变为2倍
    
    enAutoSkill_ShuiAndXiaoYongAtk2,    //254 水属性和骁勇善战类武将的攻击力变为2倍
    
    enAutoSkill_MuAndXiaoYongAtk2,      //255 木属性和骁勇善战类武将的攻击力变为2倍
    
    enAutoSkill_GuangAndJinShiAtk2,     //256 光属性和金石之坚类武将的攻击力变为2倍
    
    enAutoSkill_AnAndXiaoYongAtk2,      //257 暗属性和骁勇善战类武将的攻击力变为2倍
    
    enAutoSkill_Card15_2,               //258 同52 武将掉率大幅提升(1.5)
    
    enAutoSkill_HuoHPAtk2,              //259 火属性武将的HP和攻击力变为2倍

    enAutoSkill_ShuiHPAtk2,             //260 水属性武将的HP和攻击力变为2倍

    enAutoSkill_MuHPAtk2,               //261 木属性武将的HP和攻击力变为2倍

    enAutoSkill_GuangRcvHPAtk15,        //262 光属性武将的HP、攻击力和回复力变为1.5倍
    
    enAutoSkill_AnRcvHPAtk15,           //263 暗属性武将的HP、攻击力和回复力变为1.5倍
    
    enAutoSkill_Hp20Attack4,            //264 当HP不足20%时，所有武将的攻击力变为5倍
    
    enAutoSkill_AnAndSelfAtk25,         //265 自身和暗属性武将的攻击力变为2.5倍
    
    enAutoSkill_Cmb8Atk5,               //266 连击达到8 Combos以上时，所有武将的攻击力变为5倍
    
    enAutoSkill_BenCao_3,               //267 同24 每回合回复相当于队长武将自身回复力200%的HP，没有产生消除的话不会触发该效果
    
    enAutoSkill_JinShiHP25,             //268 金石之坚类武将的HP变为2.5倍
    
    enAutoSkill_HuoGuangAnAtk25,        //269 火、光、暗同时攻击时，所有武将的攻击力变为2.5倍
    
    enAutoSkill_ShuiMuAnAtk25,          //270 水、木、暗同时攻击时，所有武将的攻击力变为2.5倍
    
    enAutoSkill_ShuiMuGuangAtk25,       //271 水、木、光同时攻击时，所有武将的攻击力变为2.5倍
    
    enAutoSkill_HuoMuGuangAtk25,        //272 火、木、光同时攻击时，所有武将的攻击力变为2.5倍
    
    enAutoSkill_HuoShuiAnAtk25,         //273 火、水、暗同时攻击时，所有武将的攻击力变为2.5倍
    
    enAutoSkill_ShengShengHP2,          //274 生生不息类武将的HP变为2倍

    enAutoSkill_ShengShengHP25,         //275 生生不息类武将的HP变为2.5倍

    enAutoSkill_XinHPAtk2,              //276 心属性武将的HP和攻击力变为2倍

    enAutoSkill_XinHP25,                //277 心属性武将的HP变为2.5倍
    
    enAutoSkill_XinAtk25,               //278 心属性武将的攻击力变为2.5倍

    enAutoSkill_ZhuiDaGod1k,            //279 每回合对所有敌人造成1000点固定伤害，该伤害不受属性影响，没有产生消除的话不会触发该效果
    
    enAutoSkill_Cmb6HuoAtk35,           //280 连击达到6Combos以上时，我方火属性武将的攻击力提升3.5倍

    enAutoSkill_Cmb6WaterAtk35,         //281 连击达到6Combos以上时，我方水属性武将的攻击力提升3.5倍

    enAutoSkill_Cmb6MuAtk35,            //282 连击达到6Combos以上时，我方木属性武将的攻击力提升3.5倍

    enAutoSkill_Cmb6GuangAtk35,         //283 连击达到6Combos以上时，我方光属性武将的攻击力提升3.5倍

    enAutoSkill_Cmb6AnAtk35,            //284 连击达到6Combos以上时，我方暗属性武将的攻击力提升3.5倍
    
    //欺压2
    enAutoSkill_QiYa2,               //285 回合结束后，对战场上最虚弱的（剩余血量百分比，如果全部满血则攻击左起第一个）
    //敌方单位造成1500%的伤害，该伤害不受属性影响，但受到防御力减免，最低伤害为0，没有产生消除的话不会触发该效果
    //瘟疫离宫2
    enAutoSkill_AtkSick2,            //286 对瘟疫状态敌人造成的普通攻击伤害变为原来的4倍
    //限界突破2
    enAutoSkill_Xjtp2,               //287 龙之魄技能效果+攻击后，回复相当于自身攻击力的HP
    
    enAutoSkill_XiaoYongAtk3,        //288 骁勇善战类武将的攻击力变为2倍
    
    // xx之魂 对应属性的武将攻击力和回复力翻倍
    enAutoSkill_LightSoul2,             //289  光属性武将的攻击力和回复力变为1.5倍
    enAutoSkill_DarkSoul2,              //290  暗属性武将的攻击力和回复力变为1.5倍
    enAutoSkill_DarkHpRcv2,             //291  所有暗属性武将的攻击力和回复力变为2倍
    enAutoSkill_MagicWillAtk2,          //292  所有魔将攻击力变为2倍
    enAutoSkill_MagicWillAtk2_5,        //293  所有魔将攻击力变为2.5倍
    enAutoSkill_MagicWillAtkRcv1_5,     //294  所有魔将攻击力,回复力变为1.5倍
    enAutoSkill_MagicWillAtkHPRcv1_5,   //295  所有魔将攻击力,HP,回复力变为1.5倍
    enAutoSkill_MagicWillHP2,           //296  所有魔将HP变为2倍
    enAutoSkill_MagicWillHPRcv2,        //297  所有魔将HP,回复力变为2倍
    enAutoSkill_MagicWillHPBig50Atk2_5, //298  HP在50%以上时,所有武将攻击力变为2.5倍
    enAutoSkill_2MagicWillHPBig50Atk2_5, //299  HP在50%以上时,所有武将攻击力变为2.5倍
    enAutoSkill_2MagicWillAtkRcv1_5,    //300  所有魔将攻击力,回复力变为1.5倍
    enAutoSkill_MagicWillAtkRcv2,       //301  所有魔将攻击力,回复力变为2倍
    enAutoSkill_MagicWillAtk3_5,        //302  所有魔将攻击力变为3.5倍
    enAutoSkill_2MagicWillAtk3_5,       //303  所有魔将攻击力变为3.5倍
    enAutoSkill_HPSmall80Atk3_5,        //304  HP在80%以下时,所有武将攻击力变为3.5倍
    enAutoSkill_2HPSmall80Atk3_5,       //305  HP在80%以下时,所有武将攻击力变为3.5倍
    enAutoSkill_GoGenXX_WLD_Atk3,       //306  与魔貂蝉，神吕布齐上阵时且水、光、暗同时攻击时,所有武将的攻击力变为3倍
    enAutoSkill_AtkEndAddHarm200,       //307  每回合正常攻击后,对所有敌人造成队长攻击力200%伤害,该伤害不受属性影响,但受防御力减免
    enAutoSkill_BatterBig3Atk2,         //308  连击数达到3以上时,所有武将攻击力变为2倍
    enAutoSkill_ReductionHarm20,        //309  所有伤害减少20%
    enAutoSkill_DragonsAtk1_5,          //310  龙系武将攻击力变为1.5倍
    enAutoSkill_DragonsAtk2_5,          //311  龙系武将攻击力变为2.5倍
    enAutoSkill_DragonsAtk3_5,          //312  龙系武将攻击力变为3.5倍
    enAutoSkill_2DragonsAtk3_5,         //313  龙系武将攻击力变为3.5倍
    enAutoSkill_2ReductionHarm20,       //314  所有伤害减少20%
    enAutoSkill_HpSmall30Atk3,          //315  HP在30%以下时,所有武将攻击力变为3倍
    enAutoSkill_OPTimeHalf_FL_Atk2_5,   //316  减少一半挪动宝珠时间,火、光属性武将攻击力变为2.5倍
    enAutoSkill_FireHPRcv2,             //317  所有火属性武将HP和回复力变为2倍
    enAutoSkill_WaterHPRcv2,            //318  所有水属性武将HP和回复力变为2倍
    enAutoSkill_WoodHPRcv2,             //319  所有木属性武将HP和回复力变为2倍
    enAutoSkill_LightHPRcv2,            //320  所有光属性武将HP和回复力变为2倍
    enAutoSkill_HPFullWaterAtk3_5_4Magic2000HP,                 //321   HP满时,所有水属性武将攻击力提升3.5倍;与魔四都督齐上阵时,每回合回复2000HP
    enAutoSkill_2HPFullWaterAtk3_5_4Magic2000HP,                //322   HP满时,所有水属性武将攻击力提升3.5倍;与魔四都督齐上阵时,每回合回复2000HP
    enAutoSkill_WaterXiaoYongAtk2_20Poison1LossUseGen3AtkHP,    //323   魔将类武将攻击力提升2倍;有20%几率使敌将中毒一回合,中毒敌人每回合损失使用技能武将攻击力3倍的伤害,该伤害无视属性与防御
    enAutoSkill_2WaterXiaoYongAtk2_20Poison1LossUseGen3AtkHP,   //324   魔将类武将攻击力提升2倍;有20%几率使敌将中毒一回合,中毒敌人每回合损失使用技能武将攻击力3倍的伤害,该伤害无视属性与防御
    enAutoSkill_WaterXiaoYongAtk2_20Freeze1LossUseGenAtkHP,     //325   魔将类武将攻击力提升2倍;有20%几率使敌将冻结一回合,冻结敌人每回合损失使用技能武将攻击力的伤害,该伤害无视属性与防御
    enAutoSkill_2WaterXiaoYongAtk2_20Freeze1LossUseGenAtkHP,    //326   魔将类武将攻击力提升2倍;有20%几率使敌将冻结一回合,冻结敌人每回合损失使用技能武将攻击力的伤害,该伤害无视属性与防御
    enAutoSkill_WaterXiaoYong80Atk2_20Atk2_5,                   //327   魔将类武将攻击力提升2倍,20%提升2.5倍
    enAutoSkill_2WaterXiaoYong80Atk2_20Atk2_5,                  //328   魔将类武将攻击力提升2倍,20%提升2.5倍
    enAutoSkill_Water3Combo2_6Combo7_9Combo4,                   //329   魔将类性武将连击时,提升攻击力(3连2倍,6连3倍,9连4倍)
    enAutoSkill_2Water3Combo2_6Combo7_9Combo4,                  //330   魔将类武将连击时,提升攻击力(3连2倍,6连3倍,9连4倍)
    enAutoSkill_1Combo5_2Combo7_5,                              //331   连击增加combo数
    enAutoSkill_332,                                            //332   骁勇善战类武将的攻击力提升2倍
    enAutoSkill_333,                                            //333   骁勇善战类武将的回复力提升2倍
    enAutoSkill_334,                                            //334   骁勇善战类武将的血量提升2倍
    enAutoSkill_335,                                            //335   神将类武将的攻击力提升3倍
    enAutoSkill_336,                                            //336   魔将类武将的攻击力提升3倍
    enAutoSkill_337,                                            //337   受到的所有伤害小幅减少   ?10%
    enAutoSkill_338,                                            //338   受到的所有伤害减少      ?20%
    enAutoSkill_339,                                            //339   火属性和国士无双类武将的攻击力提升2倍
    enAutoSkill_340,                                            //340   当受到致死攻击时，有几率生还            ?50%
    enAutoSkill_341,                                            //341   骁勇善战类武将的血量和攻击力提升2倍
    enAutoSkill_342,                                            //342   骁勇善战类武将的血量、攻击力和回复力提升1.5倍
    enAutoSkill_343,                                            //343   骁勇善战类武将的攻击力和回复力提升2倍
    enAutoSkill_344,                                            //344   骁勇善战类武将的攻击力和回复力提升2倍
    enAutoSkill_345,                                            //345   骁勇善战类武将的血量和回复力提升2倍
    enAutoSkill_346,                                            //346   骁勇善战类武将的攻击力提升3倍
    enAutoSkill_347,                                            //347   火、木、光同时攻击时，所有武将的攻击力提升3.5倍
    enAutoSkill_348,                                            //348   水、木、暗同时攻击时，所有武将的攻击力提升3.5倍
    enAutoSkill_349,                                            //349   木、光、暗同时攻击时，所有武将的攻击力提升3.5倍
    enAutoSkill_350,                                            //350   火、水、木、光同时攻击时，所有武将的攻击力提升5倍
    enAutoSkill_351,                                            //351   火、水、暗同时攻击时，所有武将的攻击力提升3.5倍
    enAutoSkill_352,                                            //352   当血量高于80%时，所有生生不息类武将的攻击力提升3.5倍
    enAutoSkill_353,                                            //353   当血量不足80%时，所有骁勇善战类武将的攻击力提升4倍
    enAutoSkill_354,                                            //354   火属性和木属性武将的攻击力提升2倍
    enAutoSkill_355,                                            //355   火属性和光属性武将的血量提升2倍
    enAutoSkill_356,                                            //356   显示文本
    enAutoSkill_357,                                            //357   显示文本2
    enAutoSkill_358,                                            //358   火属性和骁勇善战类武将攻击力和回复力提升2倍
    enAutoSkill_359,                                            //359   水属性和攻守兼备类武将攻击力和回复力提升2倍
    enAutoSkill_360,                                            //360   木属性和生生不息类武将攻击力和回复力提升2倍
    enAutoSkill_361,                                            //361   光属性和金石之坚武将攻击力和回复力提升2倍
    enAutoSkill_362,                                            //362   暗属性和魔将类武将攻击力和回复力提升2倍
    enAutoSkill_363,                                            //363   金石之坚类武将的攻击力提升3倍
    enAutoSkill_364,                                            //364   攻守兼备类武将的攻击力提升3倍
    enAutoSkill_365,                                            //365   生生不息类武将的攻击力提升3倍
    enAutoSkill_366,                                            //366   受到的所有伤害小幅减少(10%)
    
    enAutoSkill_367,                                            //367   骁勇善战类武将的攻击力提升2.5倍
    enAutoSkill_368,                                            //368   攻守兼备类武将的攻击力和回复力提升1.5倍
    enAutoSkill_369,                                            //369   金石之坚类武将的攻击力提升2倍
    enAutoSkill_370,                                            //370   金石之坚类武将的血量和攻击力提升2倍
    enAutoSkill_371,                                            //371   金石之坚类武将的血量提升2倍
    enAutoSkill_372,                                            //372   攻守兼备类武将的血量提升2倍
    enAutoSkill_373,                                            //373   骁勇善战类武将的血量提升2倍
    enAutoSkill_374,                                            //374   宝珠挪动的最大时限延长（3秒）
    enAutoSkill_375,                                            //375   当血量不足10%时，所有武将的攻击力提升5倍
    enAutoSkill_376,                                            //376   当血量不足50%时，所有火属性武将的攻击力提升3倍
    enAutoSkill_377,                                            //377   当血量不足5%时，所有水属性武将的攻击力提升5倍
    enAutoSkill_378,                                            //378   满血量时，所有木属性武将的攻击力提升3倍
    enAutoSkill_379,                                            //379   受到的所有伤害减少25%
    enAutoSkill_380,                                            //380   满血量时，受到的所有伤害减少75%
    enAutoSkill_381,                                            //381   光属性武将攻击力和回复力提升1.5倍
    enAutoSkill_382,                                            //382   暗属性武将攻击力和回复力提升1.5倍
    enAutoSkill_383,                                            //383   骁勇善战类武将的攻击力提升3(->3.5)倍；当消除6颗火宝珠或以上时（需连着），提升3.5(->4.0)倍
    enAutoSkill_384,                                            //384   血量上限减少40%，金石之坚类武将的攻击力提升4倍
    enAutoSkill_385,                                            //385   当血量大于或等于80%时，国士无双类武将的攻击力提升3.5倍；当血量不足50%时，国士无双类武将的回复力提升1.5倍
    enAutoSkill_386,                                            //386   当血量大于或等于50%时，自身攻击力提升3.5倍；若无副将时，自身属性提升3倍
    enAutoSkill_387,                                            //387   达到4连击或以上时，自身攻击力提升3.5倍；若无副将时，自身属性提升3倍
    enAutoSkill_388,                                            //388   达到4连击或以上时，所有武将的攻击力提升2倍
    
    enAutoSkill_389,                                            //389   当血量大于或等于80%时，所有火属性武将的攻击力提升3.5倍
    enAutoSkill_390,                                            //390   水，木，光，暗同时攻击时，所有武将的攻击力提升5倍
    enAutoSkill_391,                                            //391   达到3连击或以上时，攻击力上升，最多增至10倍 (由3连击开始1.5倍，之后每+1连击再+0.5倍，最大20连击10倍)
    enAutoSkill_392,                                            //392   当血量大于或等于80%时，所有神将类武将的攻击力提升3.5倍
    enAutoSkill_393,                                            //393   达到6连击或以上时，所有武将的攻击力提升4倍
    enAutoSkill_394,                                            //394   火，水，光同时攻击时，所有武将的攻击力提升2倍
    enAutoSkill_395,                                            //395   火，水，光同时攻击时，所有武将的攻击力提升2.5倍
    enAutoSkill_396,                                            //396   火，水，光同时攻击时，所有武将的攻击力提升3倍
    enAutoSkill_397,                                            //397   当HP大于或等于50%时，所有武将的攻击力提升2倍
    enAutoSkill_398,                                            //398   当受到致死攻击时，有几率生还（70%H,同ID27龙之魄）
    enAutoSkill_399,                                            //399   消除宝珠后，血量大回复（3倍自身回复力,同ID32歌莺舞燕）
    enAutoSkill_400,                                            //400   当血量不足80%时，所有金石之坚类武将的攻击力提升3.5倍
    enAutoSkill_401,                                            //401   金石之坚类武将的HP和攻击力提升2倍
    enAutoSkill_402,                                            //402   金石之坚类武将的HP和回复力提升2倍
    enAutoSkill_403,                                            //403   金石之坚类武将的攻击力和回复力提升2倍
    enAutoSkill_404,                                            //404   满血量时，所有金石之坚类武将的攻击力提升2.5倍
    enAutoSkill_405,                                            //405   金石之坚类武将的HP、攻击力和回复力提升1.5倍
    enAutoSkill_406,                                            //406   国士无双类武将的攻击力提升2.5倍
    enAutoSkill_407,                                            //407   攻击后，追加一次强力全体攻击（2倍自身攻击力，同ID26狱炎）
    enAutoSkill_408,                                            //408   骁勇善战类武将的HP和攻击力提升1.5倍
    enAutoSkill_409,                                            //409   金石之坚类武将的HP和攻击力提升1.5倍
    enAutoSkill_410,                                            //410   攻守兼备类武将的攻击力和回复力提升1.5倍
    enAutoSkill_411,                                            //411   受到伤害后，中几率反弹中幅光属性伤害（同ID93勇武之袭）
    enAutoSkill_412,                                            //412   生生不息类武将的攻击力提升2倍
    
    enAutoSkill_413,                                            //413   火属性武将的攻击力提升3倍
    enAutoSkill_414,                                            //414   蜀国武将的攻击力提升3倍（等国家系统需求出来再做）
    enAutoSkill_415,                                            //415   满血量时，火属性武将的攻击力提升4倍
    enAutoSkill_416,                                            //416   神将类武将的攻击力提升3倍
    enAutoSkill_417,                                            //417   暗属性武将的攻击力提升3倍;和魏武帝·曹操(+297)齐上阵,提升4倍;达到5连击时提升4.5倍
    enAutoSkill_418,                                            //418   消除宝珠后,血量超回复（5倍自身回复力,同ID33）;且当血量大于或等于50%时,光属性武将的攻击力提升3.5倍;满血量时,提升4倍
    enAutoSkill_419,                                            //419   战斗经验大幅提升；额外获得少量铜钱（都是1.5倍）
    enAutoSkill_420,                                            //420   狂野的不死鸟
    enAutoSkill_421,                                            //421   朔月的冷艳锋芒	生生不息类武将攻击力提高3.5倍，满血时生生不息类武将攻击力提高4倍
    enAutoSkill_422,                                            //422   暴虐的凶兽
    enAutoSkill_423,                                            //423   伤门▪天诛
    enAutoSkill_424,                                            //424   烈日的灼热辉耀	光属性武将攻击力提高3倍，和+297诸葛亮或武侯诸葛孔明齐上阵，提升4倍，满血时提高5倍
    enAutoSkill_425,                                            //425   锦帆之逆袭	攻守兼备类宠物的攻击力和回复力变为2倍
    enAutoSkill_426,                                            //426	将军之威猛	攻守兼备类宠物的攻击力变为3倍
    enAutoSkill_427,                                            //427	名将之天威	国士无双类宠物的攻击力变为3倍
    enAutoSkill_428,                                            //428	神将之天启	神类宠物的攻击力和回复力变为2倍
    enAutoSkill_429,                                            //429	历战之觉醒	国士无双类宠物的HP和攻击力变为2倍
    enAutoSkill_430,                                            //430	九五之尊·原罪	连击数达到4以上时攻击力上升，最多增至4倍 (由4连击开始2.5倍，之后每+1连击再+0.5倍，最大7连击4倍)
    enAutoSkill_431,                                            //431	金牌满营	武将掉率大幅提升，金钱掉率大幅提升
    enAutoSkill_432,                                            //432	苍龙之血	与各形态关羽（武将ID=191、192、332、333、796、995）齐上阵，攻击力提高2.5倍
    enAutoSkill_433,                                            //433	预留
    enAutoSkill_434,                                            //433	预留
    enAutoSkill_435,                                            //433	预留
    enAutoSkill_436,                                            //433	预留
    enAutoSkill_437,                                            //433	预留
    enAutoSkill_438,                                            //438	倾城的姬君	HP上限减少50%，所有攻守兼备类宠物的攻击力变成4倍
    enAutoSkill_439,                                            //439	尚武的姬君	HP上限减少50%，所有金石之坚类宠物的攻击力变成4倍
    enAutoSkill_440,                                            //440	防御·暗	暗属性敌人造成的伤害减少50%
    enAutoSkill_441,                                            //441	防御姿态·暗	暗属性敌人造成的伤害减少55%
    enAutoSkill_442,                                            //442	防御·火	火属性敌人造成的伤害减少50%
    enAutoSkill_443,                                            //443	防御姿态·火	火属性敌人造成的伤害减少55%
    enAutoSkill_444,                                            //444	防御·水	水属性敌人造成的伤害减少50%
    enAutoSkill_445,                                            //445	防御姿态·水	 水属性敌人造成的伤害减少55%
    enAutoSkill_446,                                            //446	充能	 每回合回复相当于队长宠物自身回复力200%的HP，没有产生消除的话不会触发该效果
    enAutoSkill_447,                                            //447	防御·木	木属性敌人造成的伤害减少50%
    enAutoSkill_448,                                            //448	防御姿态·木	木属性敌人造成的伤害减少55%
    enAutoSkill_449,                                            //449	防御·光	光属性敌人造成的伤害减少50%
    enAutoSkill_450,                                            //450	防御姿态·光	光属性敌人造成的伤害减少55%
    enAutoSkill_451,                                            //451	奋战	当HP不足80%时，所有国士无双类宠物的攻击力变为4倍
    enAutoSkill_452,                                            //452	自然恩惠	国士无双类宠物的HP、攻击力和回复力变为1.5倍
    enAutoSkill_453,                                            //453	大地之力	当HP为满时，受到的所有伤害减少75%
    enAutoSkill_454,                                            //454	水之波动	水属性和体力类宠物的攻击力变为2.5倍
    enAutoSkill_455,                                            //455	火之牙	受到伤害时，有约25%几率进行反击，造成10倍于受到伤害的火属性伤害
    enAutoSkill_456,                                            //456	水之尾	受到伤害时，有约25%几率进行反击，造成10倍于受到伤害的水属性伤害
    enAutoSkill_457,                                            //457	飞叶快刀	受到伤害时，有约25%几率进行反击，造成10倍于受到伤害的水属性伤害
    enAutoSkill_458,                                            //458	预知未来	战斗胜利后获得的金钱变为原本的1.5倍
    enAutoSkill_459,                                            //459	自我再生	暗属性敌人造成的伤害减少50%
    
    enAutoSkill_Max
};

//_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/
class CSkillLib {
    static CSkillLib* s_pcIf;
    
public:
	//Get the instance pointer
	static CSkillLib* Ins(){
        if(s_pcIf == NULL){
            s_pcIf = new CSkillLib();
        }
        
        return s_pcIf;
    }
    
    stManualSkill*  getManSkill(int iID);
    stAutoSkill*    getAutoSkill(int iID);
    
    const char*     getManSkillName(int iID);
    const char*     getManSkillDsp(int iID);
    
    const char*     getAutoSkillName(int iID);
    const char*     getAutoSkillDsp(int iID);
    
    int             getHateAtkPt(int iCurHp, int iMaxHp);
    
private:
    //forbid constructor being called outside
	CSkillLib(){};
    
	//forbid copy constructor being called outside
	CSkillLib(const CSkillLib& );
	
	//forbid assignment
	CSkillLib& operator=(const CSkillLib& );
    
};

#endif
